/*Full list of all the xue of the 12 jing and 8 mai"*/





/*Xue of the Lung channel - Shou Tai Yin Fei Jing*/

var zhongFu = {
	name: "Чжун-фу",
	index: "P1",
	specificLocation: "в первом подреберьи, на расстоянии 6 цуней от средней линии.",
	bodyPart: "",
	symptoms: ["диагностика", "все болезни лёгких", "ощущение переполненности в грудной клетке", "боль в грудной клетке"],
	technique: "Укол перпендикулярный, мерно на 1/2 цуня. Прижигание - до десяти минут.",
	picture: "",
	specialInfo: "Слишком глубокий укол может привести к пневмотораксу."
};

var yunMen = {
	name: "Юнь-мэнь",
	index: "P2",
	specificLocation: "в подключичной ямке (на 1 цунь выше точки Чжун-фу(P1).",
	bodyPart: "",
	symptoms: ["холод или жар в ладонях", "ограничение подвижности в плечевом суставе", "боль в подключичной ямке" ],
	technique: "Укол перпендикулярный, мерно на 1 цунь. Прижигание 10 -20 минут.",
	picture: "",
	specialInfo: ""
};

var tianFu = {
	name: "Тянь-фу",
	index: "P3",
	specificLocation: "на внутренней поверхности плеча, на три цуня ниже подмышечной складки. Также это точка касания плеча носом, если попытаться как-бы “понюхать плечо”.",
	bodyPart: "",
	symptoms: ["малярия", "носовое кровотечение"],
	technique: "Укол перпендикулярный, мерно на 1/2 цуня. Эту точку не жигают",
	picture: "",
	specialInfo: ""
};

var xiaBai = {
	name: "Ся-бай",
	index: "P4",
	specificLocation: "на бицепсе плеча, на лучевой поверхности, на 1 цунь дистальнее тянь-фу. Если стоять с опущенными лопатками, точка находится на линии сосков у мужчины.",
	bodyPart: "",
	symptoms: ["кашель", "одышка", "боль в плече", "сухая рвота"],
	technique: "Укол перпендикулярный, на 1/2 цуня (иногда, в зависимости от комплекции, - до 1 цуня), прогревание до 20 минут.",
	picture: "",
	specialInfo: ""
};

var chiZe = {
	name: "Чи-цзе",
	index: "P5",
	specificLocation: "на лучевой стороне края сухожилия бицепса плеча (с края сухожилия надо соскользнуть на лучевую сторону).",
	bodyPart: "",
	symptoms: ["для нормализации функции лёгких", "для охлаждения жара лёгких" ,"для успокоения растревоженного шень", "немотивированная тоска или грусть", "ночное недержание мочи", "понос", "рвота", "заболевания желудка", "боль в суставах локтей и колен", "отсутствие пульса", "артериальная гипертония"],
	technique: "Укол перпендикулярный, на 1 цунь. Не прижигается.",
	picture: "",
	specialInfo: "синдромах жара - укалывание с каплей крови"
};

var kongZui = {
	name: "Кун-цзуй",
	index: "P6",
	specificLocation: "на предплечьи, на линии между точкой под лучевым шиловидным отростком и лучевым краем локтевой складки, на семь цуней проксимальнее точки, находящейся под шиловидным отростком.",
	bodyPart: "",
	symptoms: ["восстановление ци лёгких", "густая кровь", "кашель", "одышка", "для освобождения кожного покрова от патогенной ци", "лихорадочные состояния", "для понижения жара и устранения головной боли связанной с ним", "кровохаркание", "кровавый геморрой"],
	technique: "Укол перпендикулярный, на 1 цунь, прогревание до пятнадцати минут. ",
	picture: "",
	specialInfo: "Основная точка"
};

var lieQue = {
	name: "Ле-цюе",
	index: "P7",
	specificLocation: "под указательным пальцем, если сомкнуть межпальцевые промежутки больших и указательных пальцев (полтора цуня выше лучезапястной складки по лучевой кости), в этом месте можно нащупать “площадку” на кости, также,  надавливании там возникают необычные тактильные ощущения.",
	bodyPart: "",
	symptoms: ["кашель", "одышка","для освобождения кожи от патогенной ци","для выделения пота при лихорадочных состояниях", "для снижения температуры", "боль в половом члене", "задержка выхода плаценты при родах", "боль в диафрагме", "немотивированное веселье", "расстройства связанные с асимметрией лица","мигрень", "ригидность мышц шеи", "боль в горле", "слабые запястья", "малярия"],
	technique: "Укол наклонный, верхний край иглы на 30 градусов от лучевой кости, острие по направлению к локтю и слегка внутрь, на глубину 1/2 цуня. Прижигание на 15 минут. ",
	picture: "",
	specialInfo: ""
};

var jingQu = {
	name: "Цзин-цюй",
	index: "P8",
	specificLocation: "в нижней части ладонной поверхности предплечья, на 1 цунь выше лучезапястной складки, в углублении между шиловидным отростком лучевой кости и лучевой артерией.",
	bodyPart: "",
	symptoms: ["кашель", "одышка", "отсутствие пульса"],
	technique: "Укол перпендикулярный, или с лёгким наклоном острия в сторону локтя, на глубину до 1/2 цуня. Не прижигается.",
	picture: "",
	specialInfo: "Совпадает с точкой гуань - (средняя точка для исследования пульса). Требуется колоть с особенной осторожностью, поскольку в этом месте рядом с поверхностью проходит артерия."
};

var taiYuan = {
	name: "Тай-юань",
	index: "P9",
	specificLocation: "на ладонной стороне лучезапястной складки, в углублении у лучевой стороны лучевой артерии, между сухожилиями лучевого сгибателя кисти и длинной отводящей мышцы I пальца, кнаружи и кверху от бугристости ладьевидной кости.",
	bodyPart: "",
	symptoms: ["боль в суставах", "тяжесть в теле", "межрёберная невралгия"],
	technique: "Укол перпендикулярный, или с лёгким наклоном острия в сторону локтя, на глубину до 1/2 цуня. Прогревание не более девяти минут.",
	picture: "",
	specialInfo: ""
};

var yuJi = {
	name: "Юй-цзи",
	index: "P10",
	specificLocation: "на границе ладонной и тыльной поверхности ладони, на середине первой пястной кости (проксимальнее большого пальца).",
	bodyPart: "",
	symptoms: ["воспаление горла", "кашель" , "одышка", "лихорадочное состояние"],
	technique: "Укол перпендикулярный, на глубину до 1/2 цуня. Не прижигается.",
	picture: "",
	specialInfo: ""
};

var shaoShang = {
	name: "Шао-шан",
	index: "P11",
	specificLocation: "на лучевой стороне большого пальца, на миллиметр от угла ногтя в сторону лучевого края.",
	bodyPart: "",
	symptoms: ["скорая помощь", "нарушения шень"],
	technique: "Укол перпендикулярный, на глубину до двух миллиметров, с появлением капли крови. Прижигается до трёх минут",
	picture: "",
	specialInfo: ""
};

var shouTaiYinFeiJing = {
	name: "канал лёгких",
	index: "P",
	channelType: "тай-инь",
	layout: "начинается в месте под названием чжун-цзяо. Сперва он опускается вниз к толстой кишке, затем делает там петлю и поднимается вверх, ко входу в желудок, после чего входит в лёгкие. Затем, пройдя через лёгкие входит в подмышечную область и оттуда выходит на поверхность тела в первом межрёберном промежутке. В этой точке происходит пересечение с ножным тай-инь селезёнки. После этого весь ход фэй-цзин проходит по поверхности тела: по внутренней поверхности плеча, по внутренней поверхности предплечья, проходит через точки определения пульса и проходит по большому пальцу до угла ногтя по лучевой стороне",	
	symptoms: ["кашель", "одышка", "кровохарканье", "боль в горле", "ощущение переполнения в грудной клетке", "беспокойство", "частое мочеиспускание", "ощущение жара в ладонях", "ощущение похолодания и онемения в верхних конечностях", "боль в верхних конечностях по ходу канала", "боль в надключичной ямке", "пересыхание кожи"],
	luo: lieQue,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	picture: "",
	xueList: [zhongFu, yunMen, tianFu, xiaBai, chiZe, kongZui, lieQue, jingQu, taiYuan, yuJi, shaoShang]
}


/*Xue of the Large Intestine channel - Shou Yang Ming Da Chang Jing*/

 var shangYang = {
	name: "Шан-ян",
	index: "GI1",
	specificLocation: "на пару миллиметров от лучевого края угла ногтя второго пальца в сторону лучевой поверхности.",
	bodyPart: "",
	symptoms: ["для возвращения ян", "для устранения аномального хода ци", "для пробуждения шень", "скорая помощь", "любые заболевания толстой кишки","зубная боль", "глазные заболевания"],
	technique: "Укол перпендикулярный, на глубину 2 мм (один шен, 1/10 цуня). Прижигание - до 9 минут.",
	picture: "",
	specialInfo: "" 
	};
	
 var erJian = {
	name: "Эр-цзянь",
	index: "GI2",
	specificLocation: "на лучевой стороне второго пальца, кпереди от пястно-фалангового сустава (во впадинке перед суставом).",
	bodyPart: "",
	symptoms: ["болезни со свойствами жара", "лихорадка без пота и без сухости во рту", "зубная боль"],
	technique: "Укол перпендикулярный, на глубину полсантиметра. Прижигание - 9 минут.",
	picture: "",
	specialInfo: ""
}; 

var sanJian = {
	name: "Сань-цзянь",
	index: "GI3",
	specificLocation: "проксимальнее пястно-фалангового сустава второго пальца на лучевой стороне",
	bodyPart: "",
	symptoms: ["ощущение тяжести в теле", "боль в суставах"],
	technique: "Укол перпендикулярный, на глубину полсантиметра. Иногда - укол наклонный, под тупым углом, по направлению к следующей точки (если использовать при болях в зубах, глазах, носу и прочих системных заболеваниях). Прижигание - 9 минут.",
	picture: "",
	specialInfo: ""
}; 

var heGu = {
	name: "Хэ-гу",
	index: "GI4",
	specificLocation: "в точке максимального возвышения мышцы между большим и указательным пальцами, если свести их вместе (на это и указывает название).",
	bodyPart: "",
	symptoms: ["заболевание толстой кишки", "зубная боль", "лицевая асимметрия","для переворачивания плода (при неверном предлежании)", "болезни горла", "расстройство шень", "скорая помощь", "женские заболевания", "головная боль (лицевая)"],
	technique: "Укол перпендикулярный, на глубину до 1 цуня. Также возможен пронизывающий укол хэ-гу - лао-гун: колоть следует в сторону центра ладони, под кость, на глубину до двух цуней. Уточнить прижигание.",
	picture: "",
	specialInfo: ""
}; 

var yangXi = {
	name: "Ян-си",
	index: "GI5",
	specificLocation: "на тыльной стороне запястья (в месте которое “напоминает движение ручья”) между сухожилиями разгибателей большого пальца руки. При максимальном отведении большого пальца в этом месте проявляется ямка.",
	bodyPart: "",
	symptoms: ["кашель", "одышка", "боль в лучезапястном суставе", "боль в дёснах и зубах"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Прогревание -  10 - 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var pianLi = {
	name: "Пянь-ли",
	index: "GI6",
	specificLocation: "на предплечьи, на на 4 пальца (3 цуня) ниже точки ян-си по направлению к цюй-чи",
	bodyPart: "",
	symptoms: ["для выведении мочи при затруднённом мочеиспускании или водянках"],
	technique: "Укол перпендикулярный, на глубину до ½ см. Прогревание  -  10 - 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var wenLiu = {
	name: "Вэнь-лю",
	index: "GI7",
	specificLocation: "На линии между ян-ци и цюй-чи - пять цуней выше ян-ци, или два цуня ниже пянь-ли.",
	bodyPart: "",
	symptoms: ["боль в животе", "боль в предплечье", "боль в плече"],
	technique: "Укол перпендикулярный, на глубину до 1 - 1½ см. Прогревание - до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var xiaLian = {
	name: "Ся-лянь",
	index: "GI8",
	specificLocation: "на линии между ян-ци и цюй-чи - на четыре цуня ниже цюй-чи",
	bodyPart: "",
	symptoms: ["боль вокруг пупка", "онемение в области локтевого сустава"],
	technique: "Укол перпендикулярный, на глубину до 1 - 1½ см. Прогревание - до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var shangLian = {
	name: "Шан-лянь",
	index: "GI9",
	specificLocation: "на линии между ян-ци и цюй-чи - на 3 цуня ниже цюй-чи",
	bodyPart: "",
	symptoms: ["затруднённое мочеиспускание жёлто-красной мочой"],
	technique: "Укол перпендикулярный, на глубину до 1 - 1½ см. Прогревание - до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var shouSanLi = {
	name: "Шоу-сань-ли",
	index: "GI10",
	specificLocation: "на линии между ян-ци и цюй-чи - на 2 цуня ниже цюй-чи (или на 3 цуня от верхушки локтя).",
	bodyPart: "",
	symptoms: ["боль в животе", "рвота", "понос", "непроизвольная дефекация", "зубная боль", "боль в верхней конечности", "боль в области плечевого сустава", "боль в надплечье", "паралич", "слабость и онемение верхней конечности"],
	technique: "Укол перпендикулярный, на глубину до 1½ см. Прогревание - до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var quChi = {
	name: "Цюй-чи",
	index: "GI11",
	specificLocation: "на лучевом краю локтевой складки.",
	bodyPart: "",
	symptoms: ["любые болезни толстой кишки", "для рассеяния жара", "кожные заболевания", "для успокоения шень"],	
	technique: "Укол перпендикулярный, на глубину до 3 см. Прогревание - до 10 минут. ",
	picture: "",
	specialInfo: ""
}; 

var zhouLiao = {
	name: "Чжоу-ляо",
	index: "GI12",
	specificLocation: "на один цунь выше цюй-чи, по переднему краю плечевой кости. В этом месте действительно есть углубление в кости - медиальный мыщелок.",
	bodyPart: "",
	symptoms: ["нарушение двигательных функций верхней конечности в районе плеча", "боль в локте или плечевом суставе", "патологическая сонливость."],
	technique: "Укол перпендикулярный, на глубину до 1 см. Прогревание - до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var shouWuLi = {
	name: "Шоу-у-ли",
	index: "GI13",
	specificLocation: "на плече, на 3 цуня выше цюй-чи (на линии между цюй-чи и цзянь-юй).",
	bodyPart: "",
	symptoms: ["патологическая сонливость", "боль в области локтевого сустава", "боль в области плеча"],
	technique: "Эту точку не колют (синоним  - да-цзинь -”большой запрет”), так как рядом проходит крупный кровеносный сосуд. Прижигание - до 5 минут.",
	specialInfo: ""
}; 

var biNao = {
	name: "Би-нао",
	index: "GI14",
	specificLocation: "Находится на линии между цюй-чи и цзянь-юй, на 7 цуней выше цюй-чи, у края дельты. В этом места соединяются дельта и бицепс.",
	bodyPart: "",
	symptoms: ["затруднённое движение в плечевом суставе", "боль в плече и области цзянь(надплечьи)"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Прогревание - до 15 минут. ",
	picture: "",
	specialInfo: ""
}; 

var jianYu = {
	name: "Цзянь-юй",
	index: "GI15",
	specificLocation: "в месте схождения акромиона и плечевой кости, при отведённой руке - передняя ямка",
	bodyPart: "",
	symptoms: ["нарушения функций щитовидной железы (например - зоб)"],
	technique: "Укол перпендикулярный, на глубину до 2 см, при отведённой руке можно колоть по направлению к дельте. Прогревание - до 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var juGu = {
	name: "Цзюй-гу",
	index: "GI16",
	specificLocation: "кзади от ключицы, возле ключично-акромиального сустава.",
	bodyPart: "",
	symptoms: ["нарушение двигательной активности верхней конечности"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Прогревание - до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var tianDing = {
	name: "Тянь-дин",
	index: "GI17",
	specificLocation: "на один цунь выше медиального края надключичной ямки, на краю грудинно-ключично-сосцевидной мышцы",
	bodyPart: "",
	symptoms: ["ощущение инородного тела в горле", "внезапная потеря голоса"],
	technique: "Укол перпендикулярный, на глубину до 1 см. и прогревание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var NeckFuTu = {
	name: "Фу-ту",
	index: "GI18",
	specificLocation: "на три цуня кнаружи (в сторону уха) от верхнего края адамова яблока.",
	bodyPart: "",
	symptoms: ["ощущение инородного тела в горле", "внезапная потеря голоса"],
	technique: "Укол перпендикулярный, до 2 см., прогревание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var NoseHeLiao = {
	name: "Хэ-ляо",
	index: "GI19",
	specificLocation: "на верхней губе в области клыка, на одном уровне с точкой жень-чжун.",
	bodyPart: "",
	symptoms: ["носовое кровотечение", "ночное стискивание зубов"],
	technique: "Укол почти горизонтальный по направлению к точке жень-чжун, на глубину в 1 см. Не прижигается.",
	picture: "",
	specialInfo: ""
}; 

var yingXiang = {
	name: "Ин-сян",
	index: "GI20",
	specificLocation: "под кончиком крыла носа, в назолабиальной складке.",
	bodyPart: "",
	symptoms: ["заложенностm носа", "насморк", "носовое кровотечение", "птоз - опущение верхней губы при лицевой асимметрии", "ощущение, что по лицу ползают насекомые (парестезия)"],
	technique: "Укол косой (45º) в сторону кончика носа на глубину ½ см. Не прижигается.",
	picture: "",
	specialInfo: "Укол часто вызывает выделение капли крови."
}; 

var shouYangMingDaChangJing = {
	name: "канал толстой кишки",
	index: "GI",
	channelType: "ян-мин",
	layout: "Начинается возле ногтя указательного пальца, на лучевой стороне. Поднимается между пястными костями первого и второго пальцев, после чего идёт по лучевой стороне предплечья. Проходит через край лучевого края локтевой складки. Идёт по плечу, до акромиона и входит в надключичную ямку. Внутри проходит возле лёгких, через диафрагму и входит в толстую кишку. Снаружи, от подключичной ямки идёт по шее и щеке и входит в нижние зубы. Там он пересекается с передне-срединным сосудом (жень-май) в точке под нижней губой. Идёт на противоположную сторону и выходит через точку задне-срединного сосуда (ду-май) к носогубной складке.",
	basicbodyPart: "",
	symptoms: ["зубная боль", "боль в горле", "отёк горла", "насморк", "носовые кровотечения", "боль по наружной поверхности верхней конечности", "нарушение подвижности второго пальца", "При избытке ци  в канале - жар и припухлость по ходу канала, а при недостатке - озноб с дрожью"],
	luo: pianLi,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	picture: "",
	xueList: [shangYang, erJian, sanJian, heGu, yangXi, pianLi, wenLiu, xiaLian, shangLian, shouSanLi, quChi, zhouLiao, shouWuLi, biNao, jianYu, juGu, tianDing, NeckFuTu, NoseHeLiao, yingXiang]
}
 

/*Xue of the Stomach channel - Zu Yang Ming Wei Jing*/

var  chengQi= {
	name: "Чэн-ци",
	index: "E1",
	specificLocation: "на нижнем краю орбиты, на уровне зрачка, смотрящего прямо (соскользнуть с кости вверх).",
	bodyPart: "",
	symptoms: ["отёк глаз", "боль в глазах", "ощущение песка в глазах", "покраснение глаз", "тик при моргании", "затуманивание зрения", "нарушение сумеречного зрения", "нарушение остроты зрения после рабочего дня"],
	technique: "Укол перпендикулярный, на глубину до 1 см. При потере остроты зрения укол направляют к внутреннему углу глаза, вдоль кромки кости. Иглу ведут медленно, нужно попросить пациента посмотреть вверх. Точку не прижигают.",
	picture: "",
	specialInfo: ""
}; 

var  siBai= {
	name: "Сы-бай",
	index: "E2",
	specificLocation: "на 1 см. ниже точки чэн-ци",
	bodyPart: "",
	symptoms: ["отёк глаз", "покраснение глаз", "боль и зуд в глазах", "частое мигание", "песок в глазах", "паралич лицевых мышц", "для выведения аскаридов"],
	technique: "",
	picture: "",
	specialInfo: "Укол перпендикулярный, на глубину до 4 мм. Не прижигается."
}; 

var  noseJuLiao= {
	name: "Цзюй-ляо",
	index: "E3",
	specificLocation: "на уровне нижнего края крыла носа, прямо под точкой сы-бай, на нижнем краю скуловой кости, в ямке.",
	bodyPart: "",
	symptoms: ["частое мигание", "гнойное течение из глаз (воспалении конъюнктивы)","опухание коленного сустава", "авитаминоз витамина B"],
	technique: "Укол горизонтальный, по направлению к носу, на глубину до 1 см. Прижигание до 5 минут.",
	picture: "",
	specialInfo: ""
}; 

var  diCang= {
	name: "Ди-цан",
	index: "E4",
	specificLocation: "Находится на ½ см. латеральнее угла рта. ",
	bodyPart: "",
	symptoms: ["лицевые асимметрии", "птоз угла рта", "парестезия нижних конечностей"],
	technique: "Укол перпендикулярный, на глубину 3 мм, или по направлению к углу рта на глубину до 4 см. (пронизывающий ди-цан - цзя-че). Прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var  daYing= {
	name: "Да-ин",
	index: "E5",
	specificLocation: "на 1½ цуня кпереди от угла нижней челюсти",
	bodyPart: "",
	symptoms: ["лицевые асимметрии", "нарушения функций жевания", "дрожание века"],
	technique: "Укол наклонный в сторону угла нижней челюсти на глубину ½ см. Не прижигают(?)",
	picture: "",
	specialInfo: ""
}; 

var  jiaChe= {
	name: "Цзя-че",
	index: "E6",
	specificLocation: "кпереди от угла нижней челюсти, если от точки перегиба перейти на щеку. В этом месте есть ощущение, что кость огибает впадинку (которая проявляется, если широко открыть рот).",
	bodyPart: "",
	symptoms: ["лицевые асимметрии", "неврит лицевого нерва", "невралгия тройничного нерва", "боль в зубах",  "нарушения шень",  "стискивании челюстей при апоплексии"],
	technique: "Укол перпендикулярный, на глубину 2 см, или наклонно, по направлению к да-ин, или горизонтально, к точке ди-цан. Прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var  xiaGuan= {
	name: "Ся-гуань",
	index: "E7",
	specificLocation: "во впадине на нижнем краю скуловой кости, рядом с отростком нижней челюсти",
	bodyPart: "",
	symptoms: ["заболевания ушей", "боль в ушах", "шум в ушах", "гнойный отит", "боль в коренных зубах",  "воспаление дёсен", "отёк под глазами (“мешки”)." ],
	technique: "Укол перпендикулярный, на глубину 1 см. Не прижигается.",
	picture: "",
	specialInfo: ""
}; 

var  touWei= {
	name: "Тоу-вэй",
	index: "E8",
	specificLocation: "на ½ цуня выше уровня роста волос, на 4½ цуня кнаружи от точки шень-тин (T24)",
	bodyPart: "",
	symptoms: ["головная боль (височная)", "головокружение", "офтальмологическая мигрень", "боль между бровями."],
	technique: "Укол горизонтальный сверху вниз, по направлению к ся-гуань, на глубину до 2 см. Не прижигается.",
	picture: "",
	specialInfo: ""
}; 

var  renYing= {
	name: "Жень-ин",
	index: "E9",
	specificLocation: "на уровне верхнего края щитовидного хряща, кпереди от грудинно-ключично-сосцевидной мышцы. В этом месте прощупывается пульсация.",
	bodyPart: "",
	symptoms: ["головная боль (из-за жара в каналах ян-мин)", "боль в области лица и лба", "покраснение лица", "бессонница", "острая рвота, или понос", "боль в горле", "отёк горла", "ощущение переполнения в грудной клетке",  "нарушения давления", "синдром отсутствия пульса."],
	technique: "Укол перпендикулярный, на глубину 6-7 мм. Колоть надо очень аккуратно в виду близости сонной артерии. Не прижигается",
	picture: "",
	specialInfo: ""
}; 

var  shuiTu= {
	name: "Шуй-ту",
	index: "E10",
	specificLocation: "снаружи от нижнего края щитовидного хряща. Надо провести пальцем от нижнего края хряща, до грудинно-ключично-сосцевидной мышцы (как и жень-ин, но на нижнем краю). На середине линии между жень-ин и ци-шэ. ",
	bodyPart: "",
	symptoms: ["ощущение инородного тела в горле", "охриплость", "отёк слизистой", "затрудненное глотание."],
	technique: "Укол перпендикулярный, на глубину 1 см. Колоть надо очень аккуратно в виду близости сонной артерии. Прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var  qiShe= {
	name: "Ци-шэ",
	index: "E11",
	specificLocation: "находится между грудинным и ключичным прикреплениями грудинно-ключично-сосцевидной мышцы, или на два пальца латеральнее яремной ямки. ",
	bodyPart: "",
	symptoms: ["вернуть ци лёгких", "вернуть ци желудка"],
	technique: "Укол перпендикулярный, на глубину 1 см. Прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var  quePen= {
	name: "Цюэ-пэнь",
	index: "E12",
	specificLocation: "в середине надключичной ямки, 4 цуня от передне-срединной линии. На середине ключицы надо соскользнуть наверх, в ямку. ",
	bodyPart: "",
	symptoms: ["кашель", "одышка", "боль в надключичной ямке", "абортивное действие"],
	technique: "Укол перпендикулярный, слегка с наклоном за ключицу (вдоль закругления кости), на глубину до 1 см.",
	picture: "",
	specialInfo: "Колоть надо очень медленно, чтобы не привести к пневмотораксу. Цзю до 10 минут. Кроме того это точка атэми. Резкий удар в эту точку приводит к потере сознания. При неспешном, но сильном нажатии человек садится на землю."
}; 

var  qiHu= {
	name: "Ци-ху",
	index: "E13",
	specificLocation: "у нижнего края ключицы, прямо под сюэ-пэнь. С середины ключицы надо соскользнуть не вверх, а вниз.",
	bodyPart: "",
	symptoms: ["для нормализации ци лёгких", "икота", "кашель",  "изменение вкусовой чувствительности"],
	technique: "Укол перпендикулярный, слегка с наклоном за ключицу (вдоль закругления кости), на глубину до 1 см (как-бы навстречу уколу сюэ-пэнь). Прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var  kuFang= {
	name: "Ку-фан",
	index: "E14",
	specificLocation: "на 4 цуня от средней линии (сосковая линия) в первом межреберьи.",
	bodyPart: "",
	symptoms: ["отхаркивание гнойно-кровянистой мокроты", "неинфекционный гепатит (вызванный отравлением алкоголем)"],
	technique: "Укол наклонный, или даже горизонтальный в сторону центральной линии, на глубину до 1 см. Цзю до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var  wuYi= {
	name: "У-и",
	index: "E15",
	specificLocation: "на 4 цуня от средней линии во втором межреберьи.",
	bodyPart: "",
   symptoms: ["мастит", "мастопатия"],
	technique: "Укол наклонный, или даже горизонтальный в сторону центральной линии (женщинам можно колоть перпендикулярно), на глубину до 2 см. Прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var  yingChuang= {
	name: "Инь-чуан",
	index: "E16",
	specificLocation: "на 4 цуня от средней линии в третьем межреберьи.",
	bodyPart: "",
	symptoms: ["мастит","мастопатия","отёк губ"],
	technique: "Укол наклонный, или даже горизонтальный в сторону центральной линии (женщинам можно колоть перпендикулярно), на глубину до 2 см. Прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var  ruZhong= {
	name: "Жу-чжун",
	index: "E17",
	specificLocation: "центр соска",
	bodyPart: "",
   symptoms: ["только для ориентира"],
	technique: "",
	picture: "",
	specialInfo: ""
}; 

var  ruGen= {
	name: "Жу-гэнь",
	index: "E18",
	specificLocation: "на 4 цуня от средней линии в пятом межреберьи.",
	bodyPart: "",
	symptoms: ["мастит","мастопатия", "увеличение количества молока (усиление секреторной функции)"],
	technique: "Укол наклонный, или даже горизонтальный в сторону центральной линии (женщинам можно колоть перпендикулярно), на глубину до 2 см. Прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var  buRong= {
	name: "Бу-жун",
	index: "E19",
	specificLocation: "на 2 цуня от средней линии (линия живота) на уровне точки цзюй-цюэ (J14) (на 6 цуней выше пупка).",
	bodyPart: "",
	symptoms: ["переедание","боль и распирание в эпигастральной области"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Прижигание до ½ часа. ",
	picture: "",
	specialInfo: ""
}; 

var  chengMan= {
	name: "Чэн-мань",
	index: "E20",
	specificLocation: "на 2 цуня от средней линии, на 5 цуней выше пупка.",
	bodyPart: "",
	symptoms: ["снижение аппетита","урчание в животе."],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до ½ часа.",
	picture: "",
	specialInfo: ""
}; 

var  liangMen= {
	name: "Лян-мэнь",
	index: "E21",
	specificLocation: "на 2 цуня от средней линии, на уровне точки чжун-вань (середина расстояния между пупком и мечевидным отростком).",
	bodyPart: "",
	symptoms: ["вздутие и боль в животе", "распирание в эпигастральной области"],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var  guanMen= {
	name: "Гуан-мэнь",
	index: "E22",
	specificLocation: "на 2 цуня от средней линии, на 3 цуня выше пупка.",
	bodyPart: "",
	symptoms: ["понос", "недержание мочи", "отёк живота", "нарушение водного обмена в желудке."],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до ½ часа.",
	picture: "",
	specialInfo: ""
}; 

var  taiYi= {
	name: "Тай-и",
	index: "E23",
	specificLocation: "на 2 цуня от средней линии, на 2 цуня выше пупка.",
	bodyPart: "",
	symptoms: ["маниакальные состояния", "расстройство шень", "больной показывает свой язык."],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до ½ часа.",
	picture: "",
	specialInfo: ""
}; 

var  huaRouMen= {
	name: "Хуа-жоу-мэнь",
	index: "E24",
	specificLocation: "на 2 цуня от средней линии, на 1 цунь выше пупка.",
	bodyPart: "",
	symptoms: ["маниакальные состояния", "расстройство шень", "больной показывает свой язык."],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до ½ часа.",
	picture: "",
	specialInfo: ""
}; 

var  tianShu= {
	name: "Тянь-шу",
	index: "E25",
	specificLocation: "на 2 цуня от средней линии, на уровне пупка.",
	bodyPart: "",
	symptoms: ["гинекологические заболевания", "нарушение менструального цикла", "месячные боли."],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до 15 минут.",
	picture: "",
	specialInfo: "Имеет абортивное действие и стимулирует родовую деятельность."
}; 

var  waiLing= {
	name: "Вай-лин",
	index: "E26",
	specificLocation: "на 2 цуня от средней линии, на 1 цунь ниже пупка.",
	bodyPart: "",
	symptoms: ["боль в эпигастральной области", "скоплении жара в каналах тонкой кишки и желудка","рези в животе."],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до ½ часа.",
	picture: "",
	specialInfo: ""
}; 

var  daJu= {
	name: "Да-цзюй",
	index: "E27",
	specificLocation: "на 2 цуня от средней линии, на 2 цуня ниже пупка.",
	bodyPart: "",
	symptoms: ["поллюции", "преждевременная эякуляции."],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var  shuiDao= {
	name: "Шуй-дао",
	index: "E28",
	specificLocation: "на 2 цуня от средней линии, на 3 цуня ниже пупка.",
	bodyPart: "",
	symptoms: ["задержка мочи", "затруднённое или болезненное мочеиспускание", "отёк живота","болезненные месячные."],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var  guiLai= {
	name: "Гуй-лай",
	index: "E29",
	specificLocation: "на 2 цуня от средней линии, на 4 цуня ниже пупка.",
	bodyPart: "",
	symptoms: ["мошоночная грыжа",  "паховая грыжа", "зуд вульвы"],
	technique: "Укол перпендикулярный, на глубину 2 см., либо, в случае мышечных расстройств или зуда вульвы, горизонтально, по направлению к симфизу (средней линии) до 4 см. (до цюй-гу).  Прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var  qiChong= {
	name: "Ци-чун",
	index: "E30",
	specificLocation: "на 2 цуня от средней линии, на 5 цуней ниже пупка, на паховой складке. В этом месте соединяется с внешним ходом внутренняя ветка.",
	bodyPart: "",
	symptoms: ["болезненное мочеиспускание", "песок в мочевыводящих путях", "маточные кровотечения", "боль в половом члене"],
	technique: "Укол перпендикулярный, на глубину 2 см., либо, в случае боли в половом члене, горизонтально, по направлению к внешним половым органам, на глубину до 4 см. Прижигание до 15 минут.",
	picture: "",
	specialInfo: "требуется колоть очень аккуратно, ввиду близости внутренних половых органов к ходу укола."
}; 

var  biGuan= {
	name: "Би-гуань",
	index: "E31",
	specificLocation: "на уровне ягодичной складки (в положении лёжа), на линии соединяющей верхнюю переднюю часть подвздошной кости и латеральный край надколенника.",
	bodyPart: "",
	symptoms: ["боль в тазобедренном суставе", "ограничение движения в тазобедренном суставе"],
	technique: "Укол перпендикулярный, на глубину 2 см. Прижигание до 15 минут. При проблемах определённого сустава колют свою сторону.",
	picture: "",
	specialInfo: ""
}; 

var  femurFuTu= {
	name: "Фу-ту",
	index: "E32",
	specificLocation: "на 6 цуней выше латерального края надколенника, на бедре. Если посмотреть на вытянутую ногу и покачать ей из стороны в сторону, то в этом месте прямая мышца будет «играть».",
	bodyPart: "",
	symptoms: [ "боль в пояснице", 	"боль в тазобедренном суставе", "ощущение холода в конечностях", "парестезия нижних конечностей"],
	technique: "Укол перпендикулярный, до 3 см., прогревание до 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var  yinShi= {
	name: "Инь-ши",
	index: "E33",
	specificLocation: "на три цуня выше латерального края надколенника. Определяется при ноги согнутой в колене, на краю прямой мышцы бедра.",
	bodyPart: "",
	symptoms: ["синдромы инь",  "недостаток ци", "синдром холода", "боль в нижних конечностях", "судороги", "слабость в ногах", "нарушение чувствительности",  "ощущение холода в ступнях и коленях", "тремор рук из-за слабости"],
	technique: "Укол перпендикулярный, на глубину до 2 см, прижигания до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var  liangQiu= {
	name: "Лян-цю",
	index: "E34",
	specificLocation: "на 2 цуня выше латерального края надколенника.",
	bodyPart: "",
	symptoms: ["боль в эпигастральной области", "боль в пояснице", "боль в колене", "воспаление молочной железы"],
	technique: "Укол перпендикулярный, на глубину до 2 см, прогревание до 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var  duBi= {
	name: "Ду-би",
	index: "E35",
	specificLocation: "под латеральным краем надколенника (при согнутом колене).",
	bodyPart: "",
	symptoms: ["гиперемия в коленном суставе", "боль в колене", "отёк колена", "нарушение подвижности"],
	technique: "Укол наклонный, как-бы под пателлу, на глубину до 2 см, прогревание до 20 минут. При ограничении подвижности в коленном суставе, при травмах латерального мениска рекомендуется укол горячей иглой.",
	picture: "",
	specialInfo: ""
}; 

var  zuSanLi= {
	name: "Цзу-сань-ли",
	index: "E36",
	specificLocation: "на три цуня ниже латерального мыщелка большеберцовой кости (от точки ду-би). Сместиться с гребня большеберцовой кости на один цунь латеральнее.",
	bodyPart: "",
	symptoms: ["любые болезни связанные с уплотнением", "любые болезни, связанные с дисбалансом ци в желудке, животе, или нижних конечностях", "любые болезни вызванные паразитами", "болезни глаз", "воспаление горла", "синдромы ветра-холода", "для поддержания жизненной ци", "для восполнения первичной ци", "для укрепления селезёнки", "для балансировки ци желудка", "для рассеивания ветра", "для растворение сырости", "для восстановления проходимости в каналах и ло", "нарушения ци в канале селезёнки",  "недостаток ци почек","недостаток крови", "имеет профилактическое действие", "болезненные месячные", "отсутствие месячных", "бесплодие", "выпадение матки", "нарушение месячных", "послеродовые боли в животе", "маточные кровотечения", "бели", "водянка живота", "отек нижних конечностях", "одышка","кашель с отхаркиванием мокроты", "вздутие живота", "мышечные нарушения", "боль в мышцах", "для успокоения шень", "бессонница", "стремление уединиться и закрыть дверь", "стремление забраться повыше и петь", "стремление ходить сняв одежду","обмороках", "мастит", "мастопатия",  "кожные заболевания", "артериальная гипертония",   "желчно-каменная болезнь"],
	technique: "Укол перпендикулярный, на глубину до 2 см., либо (при заболеваниях ноги), укол вертикально вниз, по направлению хода канала, к следующей точке. Прижигание до 30 минут.",
	picture: "",
	specialInfo: "Укол перпендикулярный, на глубину до 2 см., либо (при заболеваниях ноги), укол вертикально вниз, по направлению хода канала, к следующей точке. Прижигание до 30 минут."
}; 

var  shangZuXu= {
	name: "Шан-цзюй-сюй",
	index: "E37",
	specificLocation: "Находится на 3 цуня ниже цзу-сань-ли, вдоль гребня большеберцовой кости.",
	bodyPart: "",
	symptoms: [ "вздутие живота","метеоризм","понос с непереваренной пищей", "затруднённое мочеиспускание", "дизентерия"],
	technique: "Укол перпендикулярный, на глубину до 6 см., укол вертикально вниз, по направлению хода канала, к точке ся-цзюй-сюй. При дизентерии (специфический уровень) в этой точке оставляют иглу надолго (до ½ часа) и сразу после укола интенсивно ею манипулируют. Прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var  tiaoKou= {
	name: "Тяо-коу",
	index: "E38",
	specificLocation: "на 2 цуня ниже точки шан-цзюй-сюй.",
	bodyPart: "",
	symptoms: ["боль в суставах нижних конечностей", "боль в плечевом суставе",  "ощущение холода в голени", "отёк коленного сустава", "слабость в ногах", "опухание плечевого сустава"],
	technique: "Укол перпендикулярный, на глубину до 3 см. В случае боли в плечевом суставе соединяют уколом тяо-коу и точку чэн-шань (V59) - пронизывающий укол по направлению к точке чэн-шань, на глубину 6 см. Прижигание до 15 минут",
	picture: "",
	specialInfo: ""
}; 

var  xiaZuXu= {
	name: "Ся-цзюй-сюй",
	index: "E39",
	specificLocation: "на 3 цуня ниже точки шан-цзюй-сюй (на 1 цунь латеральнее гребня большеберцовой кости).",
	bodyPart: "",
	symptoms: ["мастит", "мастопатия", "боль в нижней части живота", "боль в подреберьи", "затруднённое мочеиспускание."],
	technique: "Укол перпендикулярный, на глубину до 1 см., либо пронизывающий укол                          вверх, на глубину до 3 см. Прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var  fengLong= {
	name: "Фэн-лун",
	index: "E40",
	specificLocation: "на 8 цуней выше латеральной лодыжки, или на 1 цунь латеральнее тяо-коу.",
	bodyPart: "",
	symptoms: ["одышка", "мокрый кашель","жидкий понос", "понос с остатками непереваренной пищи","слабость нижних конечностей" , "заложенность горла"],
	technique: "Укол перпендикулярный, на глубину до 2 см., прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var  jieXi= {
	name: "Цзе-си",
	index: "E41",
	specificLocation: "при максимально разогнутой, но не напряженной стопе, между сухожилиями разгибателей стопы. В центре поперечной складки голеностопного сустава.",
	bodyPart: "",
	symptoms: ["кашель", "одышка", "синдром жара связанныЙ с проникновением патогенной ци", "покраснение лица", "покраснение глаз", "лихорадочные состояниях без пота", "рвота", "понос", "вздутие живота", "головокружение",  "заболевания голеностопа (нарушении подвижности при разгибании)", "нарушения шень."],
	technique: "Укол перпендикулярный, на глубину до 2 см., прижигание до 5 минут, нельзя прогревать при синдромах жара.",
	picture: "",
	specialInfo: ""
}; 

var  chongYang= {
	name: "Чун-ян",
	index: "E42",
	specificLocation: "между суставами 2 и 3 клиновидных костей и суставами 2 и 3 плюсневых костей, в месте биения пульса.",
	bodyPart: "",
	symptoms: ["боль и вздутие в эпигастральной области", "сдавливание в грудной клетке", "боль в области лица", "расстройства шень"],
	technique: "Укол перпендикулярный, на глубину до 1 см., не прижигается.",
	picture: "",
	specialInfo: "Важно не попасть в артерию"
}; 

var  xianGu= {
	name: "Сянь-гу",
	index: "E43",
	specificLocation: "между 2 и 3 плюсневыми костями, проксимальнее плюсно-фалангового сустава.",
	bodyPart: "",
	symptoms: ["боль в суставах",  "боль в животе", "вздутие живота", "отёк лица", "заболевание суставов"],
	technique: "Укол перпендикулярный, на глубину до 1 см., прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var  neiTing= {
	name: "Нэй-тин",
	index: "E44",
	specificLocation: "во впадине между вторым и третьим пальцами, на чуть кпереди от фалангового сустава.",
	bodyPart: "",
	symptoms: ["боль в животе",  "носовые кровотечения", "боль в стопе",  "боль в области голеностопа",  "боль в мышцах-разгибателях", "лицевая асимметрия (инсульт, неврит, невралгия)."],
	technique: "",
	picture: "",
	specialInfo: ""
}; 

var  liDui= {
	name: "Ли-дуй",
	index: "E45",
	specificLocation: "возле латерального кончика ногтя, на втором пальце стопы.",
	bodyPart: "",
	symptoms: ["скорая помощ",  "боль в животе",  "воспаление горла",  "кровотечение из носа", "лицевая асимметрия", "обморок"],
	technique: "Укол перпендикулярный на глубину 2 мм. Цзю до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var zuYangMingWeiJing = {
	name: "канал желудка",
	index: "E",
	channelType: "ян-мин",
	layout: "Начинается в точке ин-сян, поднимается  точке инь-тан (переносица), проходит (ныряет) через цин-мин (V1, уголок глаза)  выходит на нижнем краю орбиты в чэн-ци (сбор слёз). Затем опускается вниз, к точке жень-чжун (внутренним ходом). Затем огибает рот через точку чэн-цзян (сбор слюны), затем идёт к нижней челюсти да-ин ﴾E5 ﴿и к краю нижней челюсти цзя-чэ ﴾E6﴿, затем поднимается вверх до точки тоу-вэй ﴾E8, угол  волос на виске), далее к точке шень-тин (T24), посередине надо лбом. Вторая ветка канала опускается по горлу до точки ци-шэ ﴾E11﴿. Затем входит в тело и идёт к точке да-чжуй, возвращаясь выходит в надключичной ямке, в точке цюе-пэнь ﴾E12﴿. Внутри проходит диафрагму,  входит в желудок, проходит рядом с селезёнкой, выныривает в точках шан-вань (J13) и чжун-вань(J12). Основной канал от надключичной ямки проходит через сосок и по животу на два цуня от срединной линии до точки в паховой складке ци-чун (E30). Ветка этого канала от привратника желудка внутренним ходом спускается до той же точки и соединяясь выходит на переднюю поверхность бедра и затем, по передне-наружной поверхности большеберцовой кости (голени), по тылу стопы до большого пальца ноги, где заканчивается в точке ли-дуй. Ещё одна ветка отходит от точки цзу-сань-ли (E 36), опускается до среднего пальца стопы, ещё одна ветка от точки чун-ян (тыл стопы E42) идёт 4 основанию большого пальца ноги в точке инь-бай (RP1).",
	basicbodyPart: "",
	symptoms: ["Вздутие живота", "боль в животе", "урчание в животе", "внезапный голод", "избыточное потоотделение", "насморк", "боль в горле", "отёки в области шеи", "боль в области большой грудной мышцы", "боль в области соска", "боль по передней поверхности бедра", "боль по передне-внешней стороны голени",  "боль в области тыла стопы", "при тяжёлых нарушениях шень - желание ходить без одежды и петь, взобравшись повыше."],
	luo: fengLong,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	picture: "",
	xueList: [chengQi, siBai, noseJuLiao, diCang, daYing, jiaChe, xiaGuan, touWei, renYing, shuiTu, qiShe, quePen, qiHu, kuFang, wuYi, yingChuang, ruZhong, ruGen, buRong, chengMan, liangMen, guanMen, taiYi, huaRouMen, tianShu, waiLing, daJu, shuiDao, guiLai, qiChong, biGuan, femurFuTu, yinShi, liangQiu, duBi, zuSanLi, shangZuXu, tiaoKou, xiaZuXu, fengLong, jieXi, chongYang, xianGu, neiTing, liDui]
}


/*Xue of the Spleen channel - Zu Tai Yin Pi Jing*/

var yinBai= {
	name: "Инь-бай",
	index: "RP1",
	specificLocation: "в медиальном углу большого пальца.",
	bodyPart: "",
	symptoms: [ "скорая помощь", "нарушения шень" ,"старческая деменция", "нарушения подвижности большого пальца стопы."],
	technique: "Укол перпендикулярный, на глубину до 2 мм, если используется для гашения жара, то с выделением капли крови. Прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var daDu= {
	name: "Да-ду",
	index: "RP2",
	specificLocation: "кпереди от плюсно-фалангового соединения большого пальца стопы, на границе сторон стопы.",
	bodyPart: "",
	symptoms: ["запор", "боль в области желудка", "тошнота","рвота", "нарушения подвижности большого пальца стопы."],
	technique: "Укол на глубину до 1 см. Прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var taiBai= {
	name: "Тай-бай",
	index: "RP3",
	specificLocation: "кзади от головки первой плюсневой кости, на “границе светлого и тёмного”",
	bodyPart: "",
	symptoms: ["ощущение тяжести в теле", "боль в суставах", "боль в эпигастральной области", "вздутие живота", "расстройство стула", "жидкий стул со слизью или с кровью", "боль в языке", "тяжесть в теле", "отёк в области коленного сустава", "боль в голени", "судороги нижних конечностей", "ощущение переполнения в грудной клетке."],
	technique: "Укол на глубину до 1 см. Прижигание до 10 минут. Укол часто бывает болезненный.",
	picture: "",
	specialInfo: ""
}; 

var gongSun= {
	name: "Гун-сунь",
	index: "RP4",
	specificLocation: "на переднем краю плюсневой кости (также на границе).",
	bodyPart: "",
	symptoms: ["заболевания желудка", "женские заболевания", "болезни живота", "болезни грудной клетки", "болезни сердца", "слабость в ногах", "боль в эпигастральной области."],
	technique: "Укол на глубину до 1 см., либо, если используют как точку слияния то на глубину до 4 см., в сторону юн-цюань. Прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var shangQiu= {
	name: "Шан-цю",
	index: "RP5",
	specificLocation: "между бугром ладьевидной кости и медиальной лодыжкой. Впадинка выделится при приведенной стопе.",
	bodyPart: "",
	symptoms: ["одышка", "кашель", "приступ неукротимого лающего кашля", "расстройства стула",  "скованность языка",  "боль в области медиальной лодыжки",  "рвота без остатков пищи (желчь или слизь)."],
	technique: "Укол на глубину до ½ см., либо пронизывающий в сторону цзе-си, до 3 см. Прижигание до 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var sanYinJiao= {
	name: "Сань-инь-цзяо",
	index: "RP6",
	specificLocation: "на 3 цуня выше вершины медиальной лодыжки (соскользнуть с края большеберцовой кости).",
	bodyPart: "",
	symptoms: ["гинекологические расстройства","акушерские расстройства",  "половые расстройства",  "болезни канала селезёнки (любые)."],
	technique: "Укол на глубину до 2 см. Прижигание до 15 минут. ",
	picture: "",
	specialInfo: ""
}; 

var louGu= {
	name: "Лоу-гу",
	index: "RP7",
	specificLocation: "на 3 цуня выше точки сань-инь-цзяо (соскользнуть с края большеберцовой кости).",
	bodyPart: "",
	symptoms: ["затрудненное мочеиспускание",  "неврит большеберцового нерва", "дисковая грыжа L4-L5."],
	technique: "Укол перпендикулярный, на глубину до 2 см. Прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var diJi= {
	name: "Ди-цзи",
	index: "RP8",
	specificLocation: "на три цуня ниже точки инь-лин-цюань.",
	bodyPart: "",
	symptoms: ["расстройства связанные с застоем крови", "альгоменорея", "аменорея", "дисменорея", "миома", "нарушение водного обмена", "отёк", "вздутие", "избыточное количество жидкости в толстой кишке."],
	technique: "Укол перпендикулярный, на глубину до 2 см., прижигание до 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var yinLingQuan= {
	name: "Инь-лин-цюань",
	index: "RP9",
	specificLocation: "кнутри от угла медиального мыщелка большеберцовой кости (соскользнуть с угла в сторону икроножной мышцы).",
	bodyPart: "",
	symptoms: [ "заболевания связаннын со свойствами сырости и флегмы", "боль в колене", "опухоль медиальной поверхност коленного сустава", "бурсит"],
	technique: "Укол перпендикулярный, на глубину до 2 см, или наклонный под кость в сторону ян-лин-цюань, на глубину до 7 см. Прижигание до 15 минут.",
	picture: "",
	specialInfo: ""
}; 

var xueHai= {
	name: "Сюэ-хай",
	index: "RP10",
	specificLocation: "на два цуня выше внутреннего края надколенника. Надо охватить одноименной рукой колено (не себе) - указательный палец придёт на точку, или отложить 3 пальца от края надколенника.",
	bodyPart: "",
	symptoms: ["нарушения менструального цикла", "маточные кровотечения",  "боль в колене", "опухоль колена", "неврологические боли по передне-внутренней поверхности бедра (корешковый синдром L4-L5)",  "крапивница", "капающее мочеиспускание"],
	technique: "Укол перпендикулярный, на глубину до 2 см, прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
};

var jiMen= {
	name: "Цзи-мэнь",
	index: "RP11",
	specificLocation: "на внутренней поверхности бедра, на 6 цуней выше сюэ-хай. Укол в положении сидя, вытянув ноги.",
	bodyPart: "",
	symptoms: ["отёк паховой области","недержание мочи (не ночное)", "капающее мочеиспускание", "синдром сырости и жара (с нарушением мочеиспускания)", "неврологические проблемы внутренней поверхности бедра"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Прежде чем ставить иглу следует проверить что колешь не в артерию. Прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var chongMen= {
	name: "Чун-мэнь",
	index: "RP12",
	specificLocation: "на паховой складке, на уровне верхнего края лобковой кости. На линии сюэ-хай - чун-мэнь отсчитывают нахождение цзи-мэнь.",
	bodyPart: "",
	symptoms: ["боль в области паховой складки", "паховая грыжа", "любые нарушениях мочеиспускания"],
	technique: "Укол перпендикулярный, на глубину до 1 см., прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var fuShe= {
	name: "Фу-ше",
	index: "RP13",
	specificLocation: "на расстоянии 4 цуня от средней линии и на ½ цуня выше цюй-гу",
	bodyPart: "",
	symptoms: ["локальные затвердения в животе (в жировом слое)",],
	technique: "Укол перпендикулярный,, на глубину до 2 см. Прижигание до 20 минут.",
	picture: "",
	specialInfo: "Эту точку не используют при беременности."
}; 

var fuJie= {
	name: "Фу-цзе",
	index: "RP14",
	specificLocation: "на 4 цуня кнаружи от средней линии, на 1⅓ цуня ниже точки да-хэн.",
	bodyPart: "",
	symptoms: ["боль в области пупка и «асимметрии пупка» (существует специальная диагностика асимметрии пупка. Вставляют палец в пупок и двигают в разные стороны и сравнивают отдачу)."],
	technique: "Укол перпендикулярный, на глубину до 2 см, прижигание до ½ часа.",
	picture: "",
	specialInfo: "Не используется при беременности."
}; 

var daHeng= {
	name: "Да-хэн",
	index: "RP15",
	specificLocation: "на 4 цуня латеральнее пупка",
	bodyPart: "",
	symptoms: ["сосущая боль в животе", "понос", "инфекционный понос"],
	technique: "Укол перпендикулярный, на глубину до 2 см, прижигание до 10 минут.",
	picture: "",
	specialInfo: ""
}; 

var fuAi= {
	name: "Фу-ай",
	index: "RP16",
	specificLocation: "от пупка на три цуня вверх и 4 цуня в сторону.",
	bodyPart: "",
	symptoms: ["урчание в животе", "понос"],
	technique: "Укол перпендикулярный, на глубину до 2 см, прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var shiDou= {
	name: "Ши-доу",
	index: "RP17",
	specificLocation: "в пятом межреберном промежутке, на 6 цуней от средней линии.",
	bodyPart: "",
	symptoms: ["вздутие живота", "урчание в животе", "нарушение ограничивающей функции ци «синдромах пустоты» из-за длительной болезни или преклонного возраста"],
	technique: "Укол наклонный, вниз, почти вдоль кожи, на глубину до 1 см, прижигание до 20 минут.",
	picture: "",
	specialInfo: ""
}; 

var tianXi= {
	name: "Тянь-си",
	index: "RP18",
	specificLocation: "на 2 цуня латеральнее соска (у мужчины), 6 цуней от средней линии.",
	bodyPart: "",
   symptoms: ["недостаток лактации", "мастит", "мастопатия", "отек молочной железы"],
	technique: "Укол наклонный, кнаружи, на глубину до 1 см, прижигание 20 минут.",
	specialInfo: ""
}; 

var xiongXiang= {
	name: "Сюн-сян",
	index: "RP19",
	specificLocation: "в третьем межреберьи, на 6 цуней от средней линии.",
	bodyPart: "",
	symptoms: ["боль в груди с иррадиацией в спину"],
	technique: "Укол наклонный, кнаружи до 1 см, прижигание до 20 минут.",
	specialInfo: ""
}; 

var zhouRong= {
	name: "Чжоу-жун",
	index: "RP20",
	specificLocation: "во втором межреберьи, на 6 цуней от средней линии.",
	bodyPart: "",
	symptoms: ["для восстановления связи между энергией лёгких и энергией селезёнки", "чувство переполнения в грудной клетке", "боль в грудной клетке","кашель", "одышка","гнойные или кровавые выделения","болезни легких"],
	technique: "Укол наклонный, кнаружи на глубину до 1 см, прижигание до 20 минут.",
	specialInfo: ""
}; 

var daBao= {
	name: "Да-бао",
	index: "RP21",
	specificLocation: "в 6 межреберьи, на подмышечной линии.",
	bodyPart: "",
	symptoms: ["расстройство в любом из ло"],
	technique: "Укол наклонный, кзади, на глубину до 1 см, прижигание до 20 минут.",
	specialInfo: ""
}; 



var zuTaiYinPiJing = {
	name: "канал селезёнки",
	index: "RP",
	channelType: "ян-мин",
	layout: "Начинается возле большого пальца ноги возле внутреннего края, поднимается по ноге, И заканчивается в туловище. Идёт по стороне стопы, Как будто по разделительной линии между низом и боковой частью стопы, Поднимаются по внутренней стороне икры, затем идёт вдоль большеберцовой кости, потом по внутренней поверхности бедра, входит в живот, связывается с желудком, идёт к диафрагме, потом огибает гортань и входит в корень языка. Затем, идёт под языком.",
	basicbodyPart: "",
	symptoms: ["скованность языка", "боль в животе", "вздутие живота", "отрыжка", "ощущение тяжести во всём теле", "отёк внутренней поверхности коленного сустава", "ограничение подвижности в большом пальце ноги, когда трудно стоять (из-за скованности)."],
	luo: [gongSun, daBao],
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [yinBai, daDu, taiBai, gongSun, shangQiu, sanYinJiao, louGu, diJi, yinLingQuan, xueHai, jiMen, chongMen, fuShe, fuJie, daHeng, fuAi, shiDou, tianXi, xiongXiang, zhouRong, daBao]
}

/*Xue of the Heart channel - Shou Shao Yin Xin Jing*/

var  jiQuan= {
	name: "Цзи-цюань",
	index: "C1",
	specificLocation: "в подмышечной впадине, в самом центре, в самом глубоком месте.",
	bodyPart: "",
	symptoms: ["редко", "депрессия", "плохое настроение"],
	technique: "Укол перпендикулярный на глубину до 1 см. Прижигание до 10 минут.",
	specialInfo: ""
}; 

var  qingLing= {
	name: "Цин-лин",
	index: "C2",
	specificLocation: "на прямой линии между первой и третьей точкой, на 3 цуня выше последней.",
	bodyPart: "",
	symptoms: ["боль в плече"],
	technique: "Укол перпендикулярный на глубину до 1 см. Прижигание до 10 минут.",
	specialInfo: ""
}; 
var  shaoHai= {
	name: "Шао-хай",
	index: "C3",
	specificLocation: "между локтевым краем локтевой складки и надмыщелком локтевой кости, если руку согнуть в локте.",
	bodyPart: "",
	symptoms: [ "рвота с пеной", "отрыжка","ощущение распирания в грудной клетке", "головокружение (из-за недостатка крови)","нарушения шень", "раздражительность", "бессонница", "нарушение памяти", "боль в плече"],
	technique: "Укол перпендикулярный на глубину до 1 см. Прижигание до 15 минут.",
	specialInfo: ""
}; 
var  lingDao= {
	name: "Лин-дао",
	index: "C4",
	specificLocation: "на 1.5 цуня выше проксимальной складки запястья, соскользнуть медиально с сухожилия сгибателя кисти.",
	bodyPart: "",
	symptoms: [ "потеря голоса (внезапная)", "ощущение сдавленности в грудной клетке", "сердцебиение"],
	technique: "Укол перпендикулярный на глубину до 1 см. Прижигание до 10 минут.",
	specialInfo: ""
}; 
var  tongLi= {
	name: "Тун-ли",
	index: "C5",
	specificLocation: "на 1 цунь выше проксимальной складки запястья.",
	bodyPart: "",
	symptoms: ["при синдромах ло", "сдавленность в грудной клетке","сердцебиение", "депрессия", "сонливость", "нежелание двигаться", "нежелание говорить", "скованность языка", "отёк горла", "потеря голоса"],
	technique: "Укол перпендикулярный на глубину до 1 см. Прижигание до 10 минут.",
	specialInfo: ""
}; 
var  yinXi= {
	name: "Инь-си",
	index: "C6",
	specificLocation: "на 1/2 цуня выше проксимальной складки запястья.",
	bodyPart: "",
	symptoms: ["ночной пот", "сердцебиение"],
	technique: "Укол перпендикулярный на глубину до 1 см. Прижигание до 10 минут.",
	specialInfo: ""
}; 
var  shenMen= {
	name: "Шень-мэнь",
	index: "C7",
	specificLocation: "на локтевом краю лучезапястной складки.",
	bodyPart: "",
	symptoms: ["любые нарушения шень", "любые сердечные расстройства", "расстройство тонкой кишки (наряду с сердцем)"],
	technique: "Укол перпендикулярный на глубину до 1 см. Прижигание до 10 минут.",
	specialInfo: ""
}; 
var  shaoFu= {
	name: "Шао-фу",
	index: "C8",
	specificLocation: "на ладони, между 4 и 5 пястными костями, на уровне точки лао-гун.",
	bodyPart: "",
	symptoms: ["жажда", "затруднённое мочеиспускание", "запор", "красноватая моча", "приапизм"],
	technique: "Укол перпендикулярный на глубину до 1 см. Прижигание до 7 минут.",
	specialInfo: ""
}; 
var  shaoChong= {
	name: "Шао-чун",
	index: "C9",
	specificLocation: "на лучевой стороне мизинца, чуть ниже уголка ногтя.",
	bodyPart: "",
	symptoms: ["боль в сердце", "серцебиение", "скорая помощь", "солнечный удар"],
	technique: "Укол перпендикулярный на глубину до 2 мм. Прижигание до 15 минут.",
	specialInfo: ""
}; 


var shouShaoYinXinJing = {
	name: "канал сердца",
	index: "C",
	channelType: "шао-инь",
	layout: "Начинается от сердца и через лёгкие выходит к  подмышечной впадине, там выходит на поверхность в точке цзи-цюань, дальше идёт по локтевому краю плеча, затем по предплечью к точке шень-мэнь (между гороховидной костью и шиловидным отростком). Входит в ладонь и идёт по лучевой стороне мизинца до точки шао-чун (на лучевой стороне основания ногтя) и в этом месте происходит соединение с каналом тонкой кишки (с другой стороны от ногтя) в точке чи-цзе(P5). Ещё одна ветка поднимается от горла к глазам.",
	basicbodyPart: "",
	symptoms: ["боль в области сердца", "сухость в горле", "жажда", "боль в грудной клетка и подреберьи", "желтоватый цвет белка глаза (не гепатит)", "боль в плече и предплечьи", "жар в ладонях", "ломкость ногтей","похолодание в пальцах"],
	luo: tongLi,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [jiQuan, qingLing, shaoHai, lingDao, tongLi, yinXi, shenMen, shaoFu, shaoChong]
}

/*Xue of the Small Intestine channel - Shou Tai Yang Xia Chang Jing*/

var  shaoZe= {
	name: "Шао-цзе",
	index: "IG1",
	specificLocation: "возле основания ногтя мизинца на локтевой стороне.",
	bodyPart: "",
	symptoms: ["скорая помощь","боль в сердце",  "расстройства шень", "катаракта", "гнойный конъюнктивит", "для улучшения лактации","воспаление молочной железы"],
	technique: "Укол перпендикулярный на глубину до 2 мм. Цзю до 10 минут.",
	specialInfo: ""
}; 

var  qianGu= {
	name: "Цянь-гу",
	index: "IG2",
	specificLocation: "дистальнее пястно-фалангового сустава мизинца (на краю складки).",
	bodyPart: "",
	symptoms: ["болезни огня-жара", "лихорадка без пота", "покраснение глаз", "затруднённое мочеиспускание", "холодный пот","горячий пот", "боль в затылке"],
	technique: "Укол перпендикулярный, на ½ см. Цзю - до 10 минут.",
	specialInfo: ""
}; 

var  houXi= {
	name: "Хоу-си",
	index: "IG3",
	specificLocation: ["кзади от локтевого края головки пятого плюснефалангового сустава (в складке, на краю одной из ладонных линий), при сжатой в кулак ладони.", "спазм поясницы и лопатки"],
	bodyPart: "",
	symptoms: ["нарушения в ду-май", "боль в области поясницы", "спазм поясницы", "нарушения шень (сумасшествие, эпилепсия)", "боль в суставах", "тяжесть в теле", "спазм поясницы и лопатки"],
	technique: "Укол перпендикулярный, на 1 см, или по направлению к точке хэ-гу, на 4 см (при полиартрите). цзю - до 10 минут.",
	specialInfo: ""
}; 

var  handWanGu= {
	name: "Вань-гу",
	index: "IG4",
	specificLocation: "на локтевом крае ладони, там где пястная кость соединяется с трёхгранной.",
	bodyPart: "",
	symptoms: ["судороги и спастические боли в мышцах", "отсутствие границ в употреблении пищи", "булимия", "обжорство"],
	technique: "Укол перпендикулярный, на 1 см, цзю - до 10 минут.",
	specialInfo: ""
}; 

var  yangGu= {
	name: "Ян-гу",
	index: "IG5",
	specificLocation: "возле шиловидного отростка локтевой кости, в том месте, где она соединяется с трёхгранной костью.",
	bodyPart: "",
	symptoms: ["боль в сердце","любые синдромы жара"],
	technique: "Укол перпендикулярный, на 1 см, цзю - до 10 минут.",
	specialInfo: ""
}; 

var  yangLao= {
	name: "Ян-лао",
	index: "IG6",
	specificLocation: "возле лучевого края головки локтевой кости.",
	bodyPart: "",
	symptoms: ["болезни связанные с болью (когда блокируется одна из функций ци).","боль в пояснице", "ухудшение зрения (при перенапряжении глаз)"],
	technique: "Укол перпендикулярный, на 1 см, Цзю - до 10 минут.",
	specialInfo: ""
}; 

var  zhiZheng= {
	name: "Чжи-чжэн",
	index: "IG7",
	specificLocation: "на 5 цуней выше лучезапястной складки, на линии которая соединяет точки ян-гу и сяо-хай.",
	bodyPart: "",
	symptoms: ["боль в пальцах руки","судорога в пальцах руки"],
	technique: "Укол перпендикулярный, на 1 см, цзю - до 10 минут.",
	specialInfo: ""
}; 

var  xiaoHai= {
	name: "Сяо-хай",
	index: "IG8",
	specificLocation: "в углублении, между локтевым отростком локтевой кости и медиальным надмыщелком плечевой кости, при согнутой руке.",
	bodyPart: "",
	symptoms: ["заболевания, связанные с пищеварением", "стоматит", "боль в нижней части живота"],
	technique: "Укол перпендикулярный, на 1 см, цзю - до 10 минут.",
	specialInfo: ""
}; 

var  jianZhen= {
	name: "Цзянь-чжень",
	index: "IG9",
	specificLocation: "прямо вверх от подмышечной впадины.",
	bodyPart: "",
	symptoms: ["заболевания плечевого сустава", "боль в области лопатки"],
	technique: "Укол перпендикулярный, на 2 см, цзю - до 15 минут.",
	specialInfo: ""
}; 

var  naoShu= {
	name: "Нао-шу",
	index: "IG10",
	specificLocation: "вверх от точки цзянь-чжень, на ости лопатки.",
	bodyPart: "",
	symptoms: ["боль в плечевом суставе", "нарушения подвижности в плечевом суставе"],
	technique: "Укол перпендикулярный, на 2 см, цзю - до 20 минут.",
	specialInfo: ""
}; 

var  tianZong= {
	name: "Тянь-цзун",
	index: "IG11",
	specificLocation: "в центре подостной ямки. Следует попросить пациента прижать руку к телу, затем нужно отыскать ость лопатки и нижний угол лопатки, от внутреннего угла ости надо отложить треть длины ости, от нижнего угла откладываем ⅔ по внешнему краю. Пересечение перпендикуляров в этих точках даёт искомое. При приведённой руке можно от от нижнего угла лопатки провести вертикальную линию до ости и на этой линии отложить ⅓ сверху.",
	bodyPart: "",
	symptoms: ["боль в области лопатки", "боль, охватывающая лопатку и надплечье"],
	technique: "Укол наклонный по направлению вверх, на глубину до 2 см. Колется в паре с цзянь-цзин. Цзю - 15 минут.",
	specialInfo: ""
}; 

var  bingFeng= {
	name: "Бин-фэн",
	index: "IG12",
	specificLocation: "в надостной ямке, над точкой тянь-цзун, примерно посередине между остью и верхним краем лопатки. Если поднять руку, в этом месте появится ямка.",
	bodyPart: "",
	symptoms: ["боль и ограничение подвижности в лопатке и плечевом суставе"],
	technique: "Укол наклонный по направлению вниз, на глубину до 1½  см. Колется вместе с цзянь-цзин или точкой тянь-цзун. Цзю - 10 минут.",
	specialInfo: ""
}; 

var  quYuan= {
	name: "Цюй-юань",
	index: "IG13",
	specificLocation: "на медиальным краем ости лопатки, в надостной ямке.",
	bodyPart: "",
	symptoms: ["боль в области лопатки"],
	technique: "Укол перпендикулярный, или наклонный по направлению вниз, на глубину до 1  см, цзю - 15 минут.",
	specialInfo: "В этой точке часто бывает колющая невралгическая боль."
}; 

var  jianWaiShu= {
	name: "Цзянь-вай-шу",
	index: "IG14",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остью первого грудного позвонка.",
	bodyPart: "",
	symptoms: ["боль в надплечьи", "боль в лопатке", "перенапряжение в надплечьи и лопатке"],
	technique: "Укол перпендикулярный, или наклонный по направлению вниз, на глубину до 1  см, цзю - 10 минут.",
	specialInfo: ""
}; 

var  jianZhongShu= {
	name: "Цзянь-чжун-шу",
	index: "IG15",
	specificLocation: "на 2 цуня латеральнее точки да-чжуй (точки под C7).",
	bodyPart: "",
	symptoms: ["боль в надплечьи", "боль в лопатке", "перенапряжение в надплечьи и лопатке", "кашель с кровью"],
	technique: "Укол наклонный по направлению вниз, на глубину до 1  см, цзю - 15 минут.",
	specialInfo: ""
}; 

var  tianChuang= {
	name: "Тянь-чуан",
	index: "IG16",
	specificLocation: "возле точки фу-ту, на пол цуня кзади и кверху.",
	bodyPart: "",
	symptoms: ["боль в шее", "боль в горле", "потеря голоса",  "шум в ушах (любой)"],
	technique: "Укол перпендикулярный, на глубину до 1 ½   см, цзю - 15 минут.",
	specialInfo: ""
}; 

var tianRong= {
	name: "Тянь-жун",
	index: "IG17",
	specificLocation: ", если соскользнуть с угла нижней челюсти по направлению к грудинноключичнососцевилной мышце.",
	bodyPart: "",
	symptoms: ["боль в шее", "отёк слизистой горла", "спазм затылочных мышц", "шум в ушах (цикады)"],
	technique: "Укол перпендикулярный, на глубину до 1½   см, цзю - 10 минут.",
	specialInfo: ""
}; 

var  quanLiao= {
	name: "Цюань-ляо",
	index: "IG18",
	specificLocation: "рядом с точной тун-цзы-ляо, надо спуститься вертикально вниз, перевалив через скуловую кость. В этом месте также есть ямка.",
	bodyPart: "",
	symptoms: ["асимметрия лица", "зубная боль",  "спазм глаз, как при ярком свете", "слёзы от ветра"],
	technique: "Укол перпендикулярный, на глубину до 1 см, или горизонтально в сторону носа (точки сы-бай) (при асимметриях) на глубину до 2 см. Уточнить прижигание.",
	specialInfo: ""
}; 

var  tingGong= {
	name: "Тин-гун",
	index: "IG19",
	specificLocation: "сразу перед козелком, определяется при открытом рте (в этом месте возникает ямка).",
	bodyPart: "",
	symptoms: ["нарушения слуха (любые)", "воспаление уха"],
	technique: "",
	specialInfo: "Укол перпендикулярный, на глубину до  ½   см, цзю - 10 минут."
}; 


var shouTaiYangXiaChangJing= {
	name: "канал тонкой кишки",
	index: "IG",
	channelType: "тай-ян",
	layout: "начинается возле локтевого края ногтя мизинца, проходит через шиловидный отросток локтевой кости. Идёт по наружной поверхности предплечья, возле медиального надмыщелка лучевой кости и по наружной поверхности плеча идёт к плечевому суставу. Идёт по лопатке, проходя через точку да-чжуй<(T14). Затем, через надключичную ямку проникает внутрь тела, проходит через диафрагму и через желудок заходит в тонкую кишку. От надключичной ямки идёт ветка к щеке, к наружному уголку глаза и там пересекается с каналом желчного пузыря, идёт обратно и входит в ухо. Там, в точке тин-гун канал заканчивается. Другая ветка идёт по щеке, под глазом и приходит к внутреннему уголку глаза, где соединяется с каналом мочевого пузыря в точке цзин-мин.",
	basicbodyPart: "",
	symptoms: ["расстройство слуха", "боль в горле", "отёчность в области нижней челюсти (невозможно оглянуться)", "ощущение перелома плеча."],
	luo: zhiZheng,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [shaoZe, qianGu, houXi, handWanGu, yangGu, yangLao, zhiZheng, xiaoHai, jianZhen, naoShu, tianZong, bingFeng, quYuan, jianWaiShu, jianZhongShu, tianChuang, tianRong, quanLiao, tingGong]
}

/*Xue of the Urinary Bladder channel - Ju Tai Yang Pang Gaung Jing*/

var jingMing= {
	name: "Цзин-мин",
	index: "V1",
	specificLocation: "на 2 мм. ниже уголка глаза.",
	bodyPart: "",
	symptoms: ["покраснение глаз","снижение остроты зрения от усталости", "снижение сумеречного зрения","конъюнктивит", "глаукома", "катаракта"],
	technique: "Укол на глубину 4 мм. Нельзя делать никаких манипуляций иглой. Игла должна пройти между глазным яблоком и костью. Не прижигается.",
	specialInfo: ""
}; 

var zanZhu= {
	name: "Цуань-чжу",
	index: "V2",
	specificLocation: "на медиальном краю брови, в углублении в кости.",
	bodyPart: "",
	symptoms: ["боль в затылке", "насморк", "чихание", "температура", "головная боль в затылке при простуде"],
	technique: "Укол почти горизонтальный по направлению сверху-вниз, под кожу, на глубину до 1 см. Не прижигают.",
	specialInfo: ""
}; 

var meiChong= {
	name: "Мэй-чун",
	index: "V3",
	specificLocation: "над точкой тянь-чжу, на середине расстояние между шень-тин и цюй-чай, примерно на середине высоты лба, на два пальца от средней линии.",
	bodyPart: "",
	symptoms: ["головная боль", "заложенность носа", "эпилепсия"],
	technique: "Укол на глубину 4 мм. Не прижигают.",
	specialInfo: ""
}; 

var quCha= {
	name: "Цюй-чай",
	index: "V4",
	specificLocation: "на 1½ цуня в сторону от точки шень-тин.",
	bodyPart: "",
	symptoms: ["расплывающееся зрение (двоится в глазах)", "фронтит", "насморк совсем прозрачной и текучей жидкостью"],
	technique: "Укол почти горизонтальный по направлению сверху-вниз, под кожу, на глубину до 1 см. Не прижигают.",
	specialInfo: ""
}; 

var wuChu= {
	name: "У-чу",
	index: "V5",
	specificLocation: "на 1 цунь выше границы роста волос, на той же линии,что и сюй-чай.",
	bodyPart: "",
	symptoms: ["заложенность носа", "неукротимый чих"],
	technique: "Укол почти горизонтальный по направлению сверху-вниз, под кожу, на глубину до 1 см. Не прижигают.",
	specialInfo: ""
}; 

var chengGuang= {
	name: "Чэн-гуан",
	index: "V6",
	specificLocation: "на 1 ½ цуня кзади от точки у-чу.",
	bodyPart: "",
	symptoms: ["фронтит"],
	technique: "Укол почти горизонтальный по направлению сверху-вниз, под кожу, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
}; 

var tongTian= {
	name: "Тун-тянь",
	index: "V7",
	specificLocation: "на 1½ цуня кзади от точки чэн-гуан.",
	bodyPart: "",
	symptoms: ["потемнение в глазах или обморок при резком вставании"],
	technique: "Укол почти горизонтальный по направлению сверху-вниз, под кожу, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
}; 

var luoQue= {
	name: "Ло-цюэ",
	index: "V8",
	specificLocation: "на 1½ цуня кзади от точки тун-тянь, на уровне точки бай-хуэй.",
	bodyPart: "",
	symptoms: ["потемнение в глазах или обморок при резком вставании", "любые нарушениях психики"],
	technique: "Укол почти горизонтальный по направлению сверху-вниз, под кожу, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
}; 

var yuZhen= {
	name: "Юй-чжень",
	index: "V9",
	specificLocation: "на 1½ цуня кзади от точки тун-тянь, на уровне точки ло-цюэ, или 1⅓ цуня от лао-ху вверх.",
	bodyPart: "",
	symptoms: ["усталость глаз", "боль в затылке"],
	technique: "",
	specialInfo: ""
}; 

var tianZhu= {
	name: "Тянь-чжу",
	index: "V10",
	specificLocation: "на задней границе роста волос на 1½ цуня от средней линии, сразу кнаружи от края прикрепления трапеции.",
	bodyPart: "",
	symptoms: ["головная боль", "боль в затылке", "тяжесть в голове и затылке", "заложенность носа","лихорадка без пота", "спазм затылочных мышц"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Цзю до 10 минут. Очень важно не колоть слишком глубоко.",
	specialInfo: ""
}; 

var daZhu= {
	name: "Да-чжу",
	index: "V11",
	specificLocation: "на уровне первого грудного позвонка (чжу), под остистым отростком D1, и на 1½ цуня в сторону.",
	bodyPart: "",
	symptoms: ["боль в суставах", "боль в лопатке", "боль в спине от долгого стояния"],
	technique: "Укол наклонный сверху вниз, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var fengMen= {
	name: "Фэн-мэнь",
	index: "V12",
	specificLocation: "на первой паравертебральной линии, на уровне второго грудного (под остистым отростком).",
	bodyPart: "",
	symptoms: ["лихорадка с жаром (особенно)"],
	technique: "Укол наклонный сверху вниз, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var feiShu= {
	name: "Фэй-шу",
	index: "V13",
	specificLocation: "на первой паравертебральной линии, на уровне точки под остистым отростком третьего грудного.",
	bodyPart: "",
	symptoms: ["крапивница", "все болезни лёгких"],
	technique: "Укол наклонный сверху вниз, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var jueYinShu= {
	name: "Цзюэ-инь-шу",
	index: "V14",
	specificLocation: "на первой паравертебральной линии под остистым отростком 4 грудного.",
	bodyPart: "",
	symptoms: ["все болезни синь-бао-ло", "болезни сердца", "расстройства шень"],
	technique: "Укол наклонный сверху вниз, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var xinShu= {
	name: "Синь-шу",
	index: "V15",
	specificLocation: "на первой паравертебральной линии, на уровне D5.",
	bodyPart: "",
	symptoms: ["все болезни синь-бао-ло","болезни сердца", "расстройства шень"],
	technique: "Укол наклонный сверху вниз, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var duShu= {
	name: "Ду-шу",
	index: "V16",
	specificLocation: "на первой паравертебральной линии под остистым D6.",
	bodyPart: "",
	symptoms: ["радикулит грудного отдела (редко)"],
	technique: "Укол наклонный сверху вниз, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var geShu= {
	name: "Гэ-шу",
	index: "V17",
	specificLocation: "на первой паравертебральной линии под остистым D7,",
	bodyPart: "",
	symptoms: ["все болезни крови", "затяжная икота"],
	technique: "Укол наклонный сверху вниз, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var ganShu= {
	name: "Гань-шу",
	index: "V18",
	specificLocation: "на первой паравертебральной линии под D9.",
	bodyPart: "",
	symptoms: ["любые болезни печени", "любые болезни глаз", "приступы немотивированного гнева"],
	technique: "Укол наклонный сверху вниз, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var danShu= {
	name: "Дань-шу",
	index: "V19",
	specificLocation: "на первой паравертебральной линии, на уровне точки под остистым отростком D10.",
	bodyPart: "",
	symptoms: ["любые нарушения желчного", "любые нарушения печени", "боль в подреберьи", "горький вкус во рту", "распирающая боль в голове", "желтый цвет склер"],
	technique: "Укол на глубину до 1 см. Сверху вниз, цзю - до 15 минут.",
	specialInfo: ""
}; 

var piShu= {
	name: "Пи-шу",
	index: "V20",
	specificLocation: "на первой паравертебральной линии, на уровне точки под остистым отростком D11.",
	bodyPart: "",
	symptoms: ["любые заболевания селезёнки", "боль в эпигастральной области", "вздутие живота", "отёк живота", "осцит", "рвота", "боль в подреберьи", "маточное кровотечение (миома)","резкое снижение веса без потери аппетита", "обширные миелопатии (общая мышечная боль или слабость)"],
	technique: "Укол на глубину до 1 см. Сверху вниз, цзю - до 15 минут.",
	specialInfo: ""
}; 

var weiShu= {
	name: "Вэй-шу",
	index: "V21",
	specificLocation: "на первой паравертебральной линии, на уровне точки под остистым отростком D12.",
	bodyPart: "",
	symptoms: ["любые нарушения желудка", "любые нарушения селезёнки", "боль в эпигастральной области", "вздутие живота", "урчание в животе", "снижение веса без потери аппетита", "рвота", "отрыжка", "тошнота"],
	technique: "Укол на глубину до 1 см. Сверху вниз, цзю - до 15 минут.",
	specialInfo: ""
}; 

var sanJiaoShu= {
	name: "Сань-цзяо-шу",
	index: "V22",
	specificLocation: "на первой паравертебральной линии на уровне точки под остистым L1.",
	bodyPart: "",
	symptoms: ["расстройство пищеварения", "расстройство водного обмена", "тошнота", "вздутие живота", "рвота", "отёк живота", "отёк нижних конечностей", "понос", "недержание мочи"],
	technique: "Укол перпендикулярный на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
}; 

var shenShu= {
	name: "Шень-шу",
	index: "V23",
	specificLocation: "на первой паравертебральной линии на уровне точки под остистым L2.",
	bodyPart: "",
	symptoms: ["недостаток ци почек", "недостаток инь почек", "недостаток ян почек", "ощущение тяжести в пояснице", "недержание мочи", "болезненные месячные", "холод в руках и ногах", "отсутствие месячных", "скопление жидкости в животе и в ногах", "шум в ушах"],
	technique: "Укол перпендикулярный на глубину до 1 см. Цзю до 20 минут.",
	specialInfo: ""
}; 

var qiHaiShu= {
	name: "Ци-хай-шу",
	index: "V24",
	specificLocation: "на первой паравертебральной линии на уровне точки под остистым L3.",
	bodyPart: "",
	symptoms: ["импотенция", "нарушения месячных"],
	technique: "Укол по направлению к центру, на глубины до 1 см., цзю до 10 минут.",
	specialInfo: ""
}; 

var daChangShu= {
	name: "Да-чан-шу",
	index: "V25",
	specificLocation: "на первой паравертебральной линии на уровне точки под остистым L4.",
	bodyPart: "",
	symptoms: ["любые нарушения в толстой кишке", "понос", "запор", "вздутие живота", "урчание в животе", "выпадение прямой кишки", "затруднённое мочеиспускание"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 20 минут. В этих местах бывают жировые отложения и корректировать глубину укола соответственно.",
	specialInfo: ""
}; 

var guanYuanShu= {
	name: "Гуань-юань-шу",
	index: "V26",
	specificLocation: "на первой паравертебральной линии на уровне точки под остистым L5.",
	bodyPart: "",
	symptoms: ["любые нарушения в толстой кишке", "понос", "запор", "вздутие живота", "урчание в животе", "выпадение прямой кишки", "затруднённое мочеиспускание"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
}; 

var xiaoChangShu= {
	name: "Сяо-чан-шу",
	index: "V27",
	specificLocation: "на первой паравертебральной линии на уровне точки под остистым S1.",
	bodyPart: "",
	symptoms: ["расстройства тонкой кишки", "нарушение пищеварения", "потеря аппетита", "запор", "понос", "капающее мочеиспускание"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
}; 

var pangGuangShu= {
	name: "Пан-гуан-шу",
	index: "V28",
	specificLocation: "на первой паравертебральной линии на уровне точки под остистым S2.",
	bodyPart: "",
	symptoms: ["все нарушения мочевого пузыря","затруднённое мочеиспускание", "частое мочеиспускание", "капающее мочеиспускание", "недержание мочи"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
}; 

var zhongLuShu= {
	name: "Чжун-люй-шу",
	index: "V29",
	specificLocation: "на первой паравертебральной линии на уровне точки под остистым S2.",
	bodyPart: "",
	symptoms: ["перенапряжение мышцы выпрямляющей позвоночник"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 30 минут.",
	specialInfo: ""
}; 

var baiHuanShu= {
	name: "Бай-хуань-шу",
	index: "V30",
	specificLocation: "на первой паравертебральной линии на уровне точки под остистым S4.",
	bodyPart: "",
	symptoms: ["бели"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
}; 

var shangLiao= {
	name: "Шан-ляо",
	index: "V31",
	specificLocation: "в первом крестцовом отверстии.",
	bodyPart: "",
	symptoms: ["выкидыш", "неспособность забеременеть", "нарушения месячных", "втягивание яичка", "фобия втяжения полового члена"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
}; 

var ciLiao= {
	name: "Цы-ляо",
	index: "V32",
	specificLocation: "во втором крестцовом отверстии.",
	bodyPart: "",
	symptoms: ["как одна из точек ба-ляо."],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
}; 

var zhongLiao= {
	name: "Чжун-ляо",
	index: "V33",
	specificLocation: "в третьем крестцовом отверстии.",
	bodyPart: "",
	symptoms: ["как одна из точек ба-ляо", "затруднённое мочеиспускание", "запор"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
}; 

var xiaLiao= {
	name: "Ся-ляо",
	index: "V34",
	specificLocation: "в четвёртом крестцовом отверстии.",
	bodyPart: "",
	symptoms: ["для усиления действия точки чжун-ляо"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 20 минут.",
	specialInfo: ""
}; 

var huiYang= {
	name: "Хуэй-ян",
	index: "V35",
	specificLocation: "на ½ цуня в сторону от копчика.",
	bodyPart: "",
	symptoms: ["приступ геморроя", "повышенная потливость половых органов (с раздражением или зудом)"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 20 минут.",
	specialInfo: ""
}; 

var chengFu= {
	name: "Чэн-фу",
	index: "V36",
	specificLocation: "в центре ягодичной складки (колоть лёжа на животе).",
	bodyPart: "",
	symptoms: ["невралгические боли седалищного нерва (редко)", "паралич нижней конечности (в случае ишиаса или инсульта)"],
	technique: "Укол перпендикулярный на глубину до 3 см. Часто при уколе надо сперва прижать это место пальцем, чтобы выбрать жировой слой. Цзю до 10 минут.",
	specialInfo: ""
}; 

var yinMen= {
	name: "Инь-мэнь",
	index: "V37",
	specificLocation: "на 6 цуней ниже чэн-фу, по средней линии задней поверхности бедра.",
	bodyPart: "",
	symptoms: ["невралгические боли седалищного нерва (редко)", "паралич нижней конечности (в случае ишиаса или инсульта)"],
	technique: "Укол перпендикулярный на глубину до 3 см. Цзю до 10 минут.",
	specialInfo: ""
}; 

var fuXi= {
	name: "Фу-си",
	index: "V38",
	specificLocation: "на один цунь выше точки вэй-ян, у медиального края сухожилия двуглавой мышцы бедра.",
	bodyPart: "",
	symptoms: ["судорога по задней поверхности ноги", "невралгические боли седалищного нерва (редко)", "паралич нижней конечности (в случае ишиаса или инсульта)"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
}; 

var weiYang= {
	name: "Вэй-ян",
	index: "V39",
	specificLocation: "на наружном крае подколенной складки, с внутреннего края сухожилия двуглавой мышцы бедра.",
	bodyPart: "",
	symptoms: ["затруднённон мочеиспускание", "задержка мочи", "невралгические боли седалищного нерва (редко)", "паралич нижней конечности (в случае ишиаса или инсульта)"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
}; 

var weiZhong= {
	name: "Вэй-чжун",
	index: "V40",
	specificLocation: "в центре подколенной ямки.",
	bodyPart: "",
	symptoms: ["любые проблемы поясницы и спины",  "для снятия жара (в крови, на коже - при крапивнице)", "нарушения мочевого пузыря",  "любые боли в животе", "нарушения в кишечнике"],
	technique: "Укол перпендикулярный на глубину до 2 см., при охлаждении и застое - с каплей крови. Цзю не делают.",
	specialInfo: ""
}; 

var fuFen= {
	name: "Фу-фэнь",
	index: "V41",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком D2.",
	bodyPart: "",
	symptoms: ["боль в области цзянь", "боль у верхнего края лопатки"],
	technique: "Укол наклонный, сверху вниз, на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var poHu= {
	name: "По-ху",
	index: "V42",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком D3.",
	bodyPart: "",
	symptoms: ["кашель", "одышка"],
	technique: "Укол наклонный, сверху вниз, на глубину до 1 см., цзю до 30 минут.  Колоть аккуратно, во избежание пневмоторакса.",
	specialInfo: ""
}; 

var gaoHuangShu= {
	name: "Гао-хуан",
	index: "V43",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком D4.",
	bodyPart: "",
	symptoms: ["профилактика", "недостаток ци", "недостаток шень", "длительное затяжное заболевание"],
	technique: "Укол наклонный, изнутри наружу (латерально), на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var shenTang= {
	name: "Шень-тан",
	index: "V44",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком D5.",
	bodyPart: "",
	symptoms: ["заболевания сердца", "расстройства шень"],
	technique: "Укол наклонный, изнутри наружу (латерально), на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var yiXi= {
	name: "И-си",
	index: "V45",
	specificLocation: "Располагается на второй паравертебральной линии, на уровне точки под остистым отростком D6.",
	bodyPart: "",
	symptoms: ["болезни сердца", "болезни лёгких", "расстройства шень"],
	technique: "Укол наклонный, изнутри наружу (латерально), на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var geGuan= {
	name: "Гэ-гуань",
	index: "V46",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком D7.",
	bodyPart: "",
	symptoms: ["отрыжка", "сложность в глотании твёрдой пищи"],
	technique: "Укол наклонный, изнутри наружу (латерально), на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var hunMen= {
	name: "Хунь-мэнь",
	index: "V47",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком D9.",
	bodyPart: "",
	symptoms: ["болезни печени"],
	technique: "Укол наклонный, изнутри наружу (латерально), на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var yangGang= {
	name: "Ян-ган",
	index: "V48",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком D10.",
	bodyPart: "",
	symptoms: ["болезни печени"],
	technique: "укол наклонный, изнутри наружу (латерально), на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var yiShe= {
	name: "И-ше",
	index: "V49",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком D11.",
	bodyPart: "",
	symptoms: ["болезни селезёнки"],
	technique: "Укол наклонный, изнутри наружу (латерально), на глубину до 1 см., цзю до 30 минут. ",
	specialInfo: ""
}; 

var weiCang= {
	name: "Вэй-цан",
	index: "V50",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком D12.",
	bodyPart: "",
	symptoms: ["болезни желудка"],
	technique: "Укол наклонный, изнутри наружу (латерально), на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var huangMen= {
	name: "Хуан-мэнь",
	index: "V51",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком L1.",
	bodyPart: "",
	symptoms: ["запор", "недержание мочи", "недостаточная лактация"],
	technique: "Укол наклонный, сверху вниз, на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var zhiShi= {
	name: "Чжи-ши",
	index: "V52",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком L2.",
	bodyPart: "",
	symptoms: ["недостаток ци почек"],
	technique: "Укол перпендикулярный, на глубину до 2 см., цзю до 20 минут.",
	specialInfo: ""
}; 

var baoHuang= {
	name: "Бао-хуан",
	index: "V53",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком S1.",
	bodyPart: "",
	symptoms: ["странгурия", "энурез", "цистит", "недержание мочи"],
	technique: "Укол перпендикулярный, на глубину до 3 см., цзю до 30 минут.",
	specialInfo: ""
}; 

var zhiBian= {
	name: "Чжи-бянь",
	index: "V54",
	specificLocation: "на второй паравертебральной линии, на уровне точки под остистым отростком S4.",
	bodyPart: "",
	symptoms: ["боль в половых органах", "боль при мочеиспускании", "ишиас"],
	technique: "Укол перпендикулярный, на глубину до 3 см., цзю до 20 минут. При ишиасе укол наклонный, сверху вниз, на глубину до 5-6 см.",
	specialInfo: ""
}; 

var heYang= {
	name: "Хэ-ян",
	index: "V55",
	specificLocation: "на два цуня ниже точки вэй-чжун.",
	bodyPart: "",
	symptoms: ["болезненные месячные", "маточное кровотечение", "любых проявлениях ишиаса (боли, или нарушении чувствительности по ходу нерва)"],
	technique: "Укол перпендикулярный, на глубину до 2 см, цзю до 20 минут.",
	specialInfo: ""
}; 

var chengJin= {
	name: "Чэн-цзинь",
	index: "V56",
	specificLocation: "посередине между точками хэ-ян и чэн-шань.",
	bodyPart: "",
	symptoms: ["судороги в икроножных мышцах", "выпадение прямой кишки", "геморрой"],
	technique: "Укол перпендикулярный, на глубину до 3 см, цзю до 20 минут.",
	specialInfo: ""
}; 

var chengShan= {
	name: "Чэн-шань",
	index: "V57",
	specificLocation: "на 1 см. дистальнее точки соединения частей икроножной мышцы. На середине расстояния между точками кунь-лунь и вэй-чжун.",
	bodyPart: "",
	symptoms: ["судороги в икроножных мышцах", "ишиас", "геморрой"],
	technique: "Укол перпендикулярный, на глубину до 2 см, цзю до 15 минут.",
	specialInfo: ""
}; 

var feiYang= {
	name: "Фэй-ян",
	index: "V58",
	specificLocation: "на 7 цуней выше точки кунь-лунь, по заднему краю малоберцовой кости.",
	bodyPart: "",
	symptoms: ["синдромы ло канала мочевого пузыря"],
	technique: "Укол перпендикулярный, на глубину до 2 см, цзю до 15 минут.",
	specialInfo: ""
}; 

var fuYang= {
	name: "Фу-ян",
	index: "V59",
	specificLocation: "на 3 цуня выше точки кунь-лунь.",
	bodyPart: "",
	symptoms: ["боль","паралич нижней конечности", "парестезия нижней конечности"],
	technique: "Укол перпендикулярный, на глубину до 2 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var kunLun= {
	name: "Кунь-лунь",
	index: "V60",
	specificLocation: "между латеральной лодыжкой и ахиллесом.",
	bodyPart: "",
	symptoms: ["заболевания глаз", "сердечные заболевания", "депрессивные состояния", "для стимуляции родовой деятельности", "задержка плаценты после родов", "кашель", "одышка", "ишиас (одна из основных точек)", "для переворачивания плода", "головная боль (в затылочной области и при “обруче” от затылка к вискам)"],
	technique: "Укол перпендикулярный, или слегка наклонно сверху вниз, или по направлению к точке тай-си, на глубину до 1 см, цзю до 15 минут.",
	specialInfo: "противопоказана при беременности до 7 месяца включительно (имеет абортивное действие)"
}; 

var puCan= {
	name: "Пу-цань",
	index: "V61",
	specificLocation: "на 1½ цуня ниже точки кунь-лунь.",
	bodyPart: "",
	symptoms: ["обморок", "предобморочное состояние", "боль в пятке"],
	technique: "Укол перпендикулярный, на глубину до ½ см, цзю до 10 минут.",
	specialInfo: ""
}; 

var shenMai= {
	name: "Шень-май",
	index: "V62",
	specificLocation: "возле нижнего края латеральной лодыжки.",
	bodyPart: "",
	symptoms: ["мышечные спазмы на наружней стороне ноги","боль в тазобедренном суставе",  "психиатрические расстройства"],
	technique: "Укол перпендикулярный, на глубину до ½ см, цзю до 5 минут.",
	specialInfo: ""
}; 

var jinMen= {
	name: "Цзинь-мэнь",
	index: "V63",
	specificLocation: "кпереди от точки шень-май, возле кубовидной кости (в углублении у края кубовидной кости).",
	bodyPart: "",
	symptoms: ["боль в глазах", "боль в темени", "боль в затылке", "боль в голени", "боль латеральной лодыжке",  "нарушения слуха (из-за патогенной ци холода-ветра)",  "потеря сознания (имеет особое значение, для возвращения)."],
	technique: "Укол перпендикулярный, на глубину до ½ см, цзю до 10 минут.",
	specialInfo: ""
}; 

var jingGu= {
	name: "Цзин-гу",
	index: "V64",
	specificLocation: "дистальнее бугристости не 5 плюсневой кости.",
	bodyPart: "",
	symptoms: ["гнойные выделения из глаз"],
	technique: "Укол перпендикулярный, или наклонный сверху вниз, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
}; 

var shuGu= {
	name: "Шу-гу",
	index: "V65",
	specificLocation: "кзади от головки 5 плюснефаланговой кости, на границе тыльной и подошвенной сторон стопы.",
	bodyPart: "",
	symptoms: ["головная боль (в теменной и затылочной областях)", "тяжесть в теле", "боль в суставах (в основном - в тазобедренном)"],
	technique: "Укол перпендикулярный, на глубину до ½ см, цзю до 10 минут.",
	specialInfo: ""
}; 

var tongGu= {
	name: "Цзу-тун-гу",
	index: "V66",
	specificLocation: "на границе тыльной и подошвенной стороны ноги дистальнее 5 плюснефалангового сустава.",
	bodyPart: "",
	symptoms: ["головная боль", "жар (боль в голове или глазах при патогенном жаре)"],
	technique: "Укол перпендикулярный, на глубину до ½ см, цзю до 10 минут.",
	specialInfo: ""
}; 

var zhiYin= {
	name: "Чжи-инь",
	index: "V67",
	specificLocation: "на 1-2 мм латеральнее края ногтя мизинца на ноге.",
	bodyPart: "",
	symptoms: ["для стимуляции родов (имеет абортивное действие)", "для переворачивания плода (следует делать около 30-32 недели, в этом случае - 20 мин. цзю)", "головные боли (в темени и в глазах)", "обморок"],
	technique: "Укол перпендикулярный, на глубину до 2-3 мм, цзю до 20 минут.",
	specialInfo: ""
}; 

var zuTaiYangPangGaungJing= {
	name: "канал мочевого пузыря",
	index: "V",
	channelType: "тай-ян",
	layout: "начинается в точке цин-мин. От точки цин-мин канал поднимается к передне-срединному сосуду, там отклоняется по голове параллельно со срединной линией, до точки напротив бай-хуэй. Затем ныряет внутрь, проходит через мозг и выходит на затылке, на линии лежащей на полтора цуня от средней линии. Проходит через точку тянь-чжу, ныряет в тело, соединяется с мочевым пузырём, делится от тянь-чжу на две ветки по первой и второй паравертебральным линиям. Одна ветка по первой линии внутренним ходом идёт к пояснице, проходит через крестцовое отверстие, идёт к горизонтальной ягодичной складке и уходит вниз в подколенную ямку. Вторая идёт от затылка к лопатке, по второй паравертебральной линии, проходит через тазобедренный сустав в подколенную ямку и там две ветки соединяются в точке вэй-чжун (V40). Далее идёт по икроножной мышце, проходит через точку кунь-лунь (около пяточной кости и ахиллесова сухожилия) и дальше идёт к мизинцу. У основания ногтя мизинца соединяется с каналом почек.",
	basicbodyPart: "",
	symptoms: ["головная боль", "глазная боль", "насморк", "боль в задней части шеи", "боли в спине и пояснице", "боль в крестце", "боль в тазобедренном суставе", "боль по задней стороне бедра", "ощущение затвердения в коленной ямке", "боль в икроножной мышце", "боль в стопе", "ограничение движения мизинца", "геморрой (нарушение ци канала)."],
	luo: feiYang,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [jingMing, zanZhu, meiChong, quCha, wuChu, chengGuang, tongTian, luoQue, yuZhen, tianZhu, daZhu, fengMen, feiShu, jueYinShu, xinShu, duShu, geShu, ganShu, danShu, piShu, weiShu, sanJiaoShu, shenShu, qiHaiShu, daChangShu, guanYuanShu, xiaoChangShu, pangGuangShu, zhongLuShu, baiHuanShu, shangLiao, ciLiao, zhongLiao, xiaLiao, huiYang, chengFu, yinMen, fuXi, weiYang, weiZhong, fuFen, poHu, gaoHuangShu, shenTang, yiXi, geGuan, hunMen, yangGang, yiShe, weiCang, huangMen, zhiShi, baoHuang, zhiBian, heYang, chengJin, chengShan, feiYang, fuYang, kunLun, puCan, shenMai, jinMen, jingGu, tongGu, zhiYin]
}


/*Xue of the Kidney channel - Ju Shao Yin Shen Jing*/


var yongQuan= {
	name: "Юн-цюань",
	index: "R1",
	specificLocation: "между вторыми и третьими плюсневыми костями, на линии от пятки до края большого пальца на расстоянии ⅖ длины линии от пальца. Если брать линию до основания большого пальца, то ⅓.",
	bodyPart: "",
	symptoms: ["скорая помощь", "обморок", "профилактика", "все болезни почек", "для восстановления шень", "боль в темени", "ощущение ломоты в костях (при лихорадке, ревматизме)", "детские судороги"],
	technique: "Укол перпендикулярный на глубину до 1 см., цзю 10 минут.",
	specialInfo: ""
}; 

var ranGu= {
	name: "Жань-гу",
	index: "R2",
	specificLocation: "в углублении кпереди от нижнего края бугорка ладьевидной кости.",
	bodyPart: "",
	symptoms: ["ощущение жара в ступнях или ладонях", "дисменорея", "аменорея", "ослабление мужской половой функции", "задержка мочи", "странгурия", "зуд в половых органах", "зуд в заднем проходе"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю 10 минут.",
	specialInfo: ""
}; 

var taiXi= {
	name: "Тай-си",
	index: "R3",
	specificLocation: "между медиальной лодыжкой и пяточным сухожилием.",
	bodyPart: "",
	symptoms: ["головокружение", "шум в ушах", "нарушение слуха", "снижении зрения", "ощущение беспричинного страха", "сновидения в которых кто-то гонится", "дисменорея", "маточные кровотечения", "тяжесть в теле", "боль в суставах (в основном - в коленном и тазобедренном)", "боль в половом члене"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю 15 минут.",
	specialInfo: ""
}; 

var daZhong= {
	name: "Да-чжун",
	index: "R4",
	specificLocation: "на ½ цуня ниже и кзади от точки тай-си.",
	bodyPart: "",
	symptoms: ["заболевания ло", "испуг", "страх", "гнев", "нарушения памяти"],
	technique: "Укол перпендикулярный на глубину до 1 см., цзю 15 минут.",
	specialInfo: ""
}; 

var shuiQuan= {
	name: "Шуй-цюань",
	index: "R5",
	specificLocation: "на 1 цунь ниже точки тай-си.",
	bodyPart: "",
	symptoms: ["любые нарушения месячных", "любые нарушения мочеиспускания"],
	technique: "Укол перпендикулярный на глубину до 1 см., цзю до 15 минут.",
	specialInfo: ""
}; 

var zhaoHai= {
	name: "Чжао-хай",
	index: "R6",
	specificLocation: "под нижним краем медиальной лодыжки.",
	bodyPart: "",
   symptoms: ["боль в горле"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю 15 минут.",
	specialInfo: ""
}; 

var fuLiu= {
	name: "Фу-лю",
	index: "R7",
	specificLocation: "на 2 цуня выше точки тай-си.",
	bodyPart: "",
	symptoms: ["кашель", "одышка", "простудные заболевания", "скопление жидкости в животе (отёк или водянка)", "скопление воздуха в животе"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю 20 минут.",
	specialInfo: ""
}; 

var jiaoXin= {
	name: "Цзяо-синь",
	index: "R8",
	specificLocation: "на ½ цуня кпереди от точки фу-лю.",
	bodyPart: "",
	symptoms: ["расстройства менструального цикла", "маточные кровотечения"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю 20 минут.",
	specialInfo: ""
}; 

var zhuBin= {
	name: "Чжу-бинь",
	index: "R9",
	specificLocation: "на 5 цуней выше точки тай-си.",
	bodyPart: "",
	symptoms: ["болезненные месячные (при острой боли внизу живота)", "слабость в икроножных мышцах"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю 10 минут.",
	specialInfo: ""
}; 

var yinGu= {
	name: "Инь-гу",
	index: "R10",
	specificLocation: "на внутреннем конце подколенной складки (при согнутой ноге).",
	bodyPart: "",
	symptoms: ["болезни почек, связанные с нарушением водообмена", "отёк коленного сустава (особенно с внутренней стороны)", "вздутие живота", "водянка", "интенсивное слюноотделении с высунутого языка"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю 15 минут.",
	specialInfo: ""
}; 

var hengGu= {
	name: "Хэн-гу",
	index: "R11",
	specificLocation: "у верхнего края лобковой кости, на ½ цуня кнаружи от точки цюй-гу.",
	bodyPart: "",
	symptoms: ["любые мочеполовые расстройства"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю 30 минут.",
	specialInfo: ""
}; 

var daHe= {
	name: "Да-хэ",
	index: "R12",
	specificLocation: "на линии живота на ½ цуня от средней линии, на 1 цуня выше от точки хэн-гу. Для нахождения можно отложить 5 пропорциональных цуней между пупком и краем лобковой кости.",
	bodyPart: "",
	symptoms: ["любые мочеполовые расстройства","боль в нижней части живота"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю 30 минут.",
	specialInfo: ""
}; 

var qiXue= {
	name: "Ци-сюэ",
	index: "R13",
	specificLocation: "на 1 цунь выше да-хэ.",
	bodyPart: "",
	symptoms: ["любые мочеполовые расстройства (редко)"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю 30 минут.",
	specialInfo: ""
}; 

var siMan= {
	name: "Сы-май",
	index: "R14",
	specificLocation: "на 1 цунь выше ци-сюэ.",
	bodyPart: "",
	symptoms: ["вздутие живота", "переедание", "любые мочеполовые расстройства","боль в нижней части живота"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю 30 минут.",
	specialInfo: ""
}; 

var zhongZhu= {
	name: "Чжун-чжу",
	index: "R15",
	specificLocation: "на 1 цунь ниже пупка на линии живота на ½ цуня от средней линии.",
	bodyPart: "",
	symptoms: ["боль в животе", "запор","любые мочеполовые расстройства","боль в нижней части живота"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю 30 минут.",
	specialInfo: ""
}; 

var huangShu= {
	name: "Хуан-шу",
	index: "R16",
	specificLocation: "на ½  цуня в сторону от пупка, на одной с ним высоте.",
	bodyPart: "",
	symptoms: ["боль в животе, сопровождающая вздутие и запор."],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю 30 минут.",
	specialInfo: ""
}; 

var shangQu= {
	name: "Шан-цюй",
	index: "R17",
	specificLocation: "на 2 цуня выше пупка, на ½ цуня от средней линии.",
	bodyPart: "",
	symptoms: ["боль в животе", "запор","любые мочеполовые расстройства","боль в нижней части живота"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю 30 минут.",
	specialInfo: ""
}; 

var shiGuan= {
	name: "Ши-гуань",
	index: "R18",
	specificLocation: "на 3 цуня выше пупка, на ½ цуня от средней линии.",
	bodyPart: "",
	symptoms: ["запор", "затвердение в животе", "любые мочеполовые расстройства","боль в нижней части живота"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю 30 минут.",
	specialInfo: ""
}; 

var yinDu= {
	name: "Инь-ду",
	index: "R19",
	specificLocation: "на 4 цуня выше пупка, на ½ цуня от средней линии.",
	bodyPart: "",
	symptoms: ["боль в животе", "любые мочеполовые расстройства","боль в нижней части живота"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю 20 минут.",
	specialInfo: ""
}; 

var tongGu= {
	name: "Фу-тун-гу",
	index: "R20",
	specificLocation: "на 5 цуня выше пупка, на ½ цуня от средней линии.",
	bodyPart: "",
	symptoms: ["нарушение прохождения пищи", "любые мочеполовые расстройства","боль в нижней части живота"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю 30 минут.",
	specialInfo: ""
}; 

var youMen= {
	name: "Ю-мэнь",
	index: "R21",
	specificLocation: "на 6 цуня выше пупка, на ½ цуня от средней линии.",
	bodyPart: "",
	symptoms: ["боль в эпигастральной области", "кровь в жидком стуле"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю 30 минут.",
	specialInfo: "Не используется при беременности. "
}; 

var buLang= {
	name: "Бу-лан",
	index: "R22",
	specificLocation: "в 5 межрёберном промежутке, на 2 цуня в сторону от центральной линии.",
	bodyPart: "",
   symptoms: ["болезни лёгких (очень редко)"],
	technique: "Укол наклонный в сторону средней линии, на 1½ см., цзю до 10 минут.",
	specialInfo: ""
}; 

var shenFeng= {
	name: "Шень-фэн",
	index: "R23",
	specificLocation: "в 4 межрёберном промежутке, на 2 цуня в сторону от центральной линии.",
	bodyPart: "",
   symptoms: ["мастит","чувство распирания в грудной клетке"],
	technique: "Укол наклонный в сторону средней линии, на 1½ см., цзю до 10 минут.",
	specialInfo: ""
}; 

var lingXu= {
	name: "Лин-сюй",
	index: "R24",
	specificLocation: "в 3 межрёберном промежутке, на 2 цуня в сторону от центральной линии.",
	bodyPart: "",
   symptoms: ["мастит","чувство распирания в грудной клетке"],
	technique: "Укол наклонный в сторону средней линии, на 1½ см., цзю до 10 минут.",
	specialInfo: ""
}; 

var shenCang= {
	name: "Шень-цан",
	index: "R25",
	specificLocation: "в 2 межрёберном промежутке, на 2 цуня в сторону от центральной линии.",
	bodyPart: "",
   symptoms: ["мастит","чувство распирания в грудной клетке"],
	technique: "Укол наклонный в сторону средней линии, на 1½ см., цзю до 10 минут.",
	specialInfo: ""
}; 

var yuZhong= {
	name: "Юй-чжун",
	index: "R26",
	specificLocation: "в 1 межрёберном промежутке, на 2 цуня в сторону от центральной линии.",
	bodyPart: "",
   symptoms: ["различные нарушения лёгких (крайне редко)"],
	technique: "Укол наклонный в сторону средней линии, на 1½ см., цзю до 10 минут.",
	specialInfo: ""
}; 

var shuFu= {
	name: "Шу-фу",
	index: "R27",
	specificLocation: "под ключицей, на 2 цуня в сторону от центральной линии.",
	bodyPart: "",
   symptoms: ["любые заболеваниях лёгких (редко)"],
	technique: "Укол наклонный в сторону средней линии, на 1½ см., цзю до 10 минут.",
	specialInfo: ""
}; 

var zuShaoYinShenJing= {
	name: "канал почек",
	index: "R",
	channelType: "шао-инь",
	layout: "TBD.",
	basicbodyPart: "",
   symptoms: ["TBD"],
	luo: daZhong,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [yongQuan, ranGu, taiXi, daZhong, shuiQuan, zhaoHai, fuLiu, jiaoXin, zhuBin, yinGu, hengGu, daHe, qiXue, siMan, zhongZhu, huangShu, shangQu, shiGuan, yinDu, tongGu, youMen, buLang, shenFeng, lingXu, shenCang, yuZhong, shuFu]
}


/*Xue of the  Xin Bao Luo channel - Shou Jue Yin Xin Bao Luo Jing*/

var tianChi= {
	name: "Тянь-чи",
	index: "MC1",
	specificLocation: "на 1 цунь латеральнее соска, или на 5 цуней от передней срединной линии в 4 межреберном промежутке.",
	bodyPart: "",
   symptoms: ["мастит", "застой молока", "увеличенные лимфоузлы в районе подмышек", "болезненный приход молока (не подходит для усиления лактации)"],
	technique: "Укол на глубину до 1 см., с наклоном к средней линии (при работе с заболеваниями молочной железы), или горизонтальный укол сверху вниз. Для того, чтобы поставить иголку женщине надо в положении лёжа убрать грудь к срединной линии, в противном случае иголка останется в ткани молочной железы. Цзю до 20 минут.",
	specialInfo: ""
}; 

var tianQuan= {
	name: "Тянь-цюань",
	index: "MC2",
	specificLocation: "на плече, на два цуня ниже подмышечной впадины (на границе между головками бицепса), находится на вытянутой руке развёрнутой ладонья вверх.",
	bodyPart: "",
   symptoms: ["боль в области плечевого сустава", "атрофия или слабость мышц нижней конечности"],
	technique: "Укол на глубину в 1 цунь, наклонный по направлению к подмышечной впадине. Цзю - до 5 минут.",
	specialInfo: ""
}; 

var quZe= {
	name: "Цюй-цзе",
	index: "MC3",
	specificLocation: "в локтевой складке, нужно от сухожилия бицепса соскользнуть к его локтевому краю.",
	bodyPart: "",
   symptoms: ["высокая лихорадка", "для снижения температуры (даже при нажатии, хорошо использовать для детей)", "различные расстройства желудка и кишечника", "крапивница"],
	technique: "Укол перпендикулярный, на глубину до 3 см. В случае использования при высокой лихорадке, укол может быть гораздо более поверхностным, но в этом случае следует добиться выступания капли крови. Для этого нужно либо пользоваться трехгранной иглой, либо толстой иглой, либо проводить специальные манипуляции с иглой. В этом случае точку не прижигают. В случае глубокого укола (при кашле) - цзю до 5 минут. ",
	specialInfo: ""
}; 

var xiMen= {
	name: "Си-мэнь",
	index: "MC4",
	specificLocation: "на 5 цуней выше лучезапястной складки, на ладонной поверхности предплечья. Нужно прижать точку и попросить пациента согнуть и разогнуть пальцы (чтобы попасть пальцем/иглой между сухожилиями).",
	bodyPart: "",
   symptoms: ["носовые кровотечения", "фурункулёз", "любые нарушения шень"],
	technique: "Укол перпендикулярный на глубину до 2 см, цзю - до 15 минут. ",
	specialInfo: ""
}; 

var jianShi= {
	name: "Цзянь-ши",
	index: "MC5",
	specificLocation: "на 3 цуня выше лучезапястной складки.",
	bodyPart: "",
   symptoms: ["различные нарушения шень", "простуда", "расстройствах селезёнки",  "отсутствие месячных (дисменорея)", "приступы малярии"],
	technique: "Укол перпендикулярный на глубину до 2 см, цзю - до 15 минут. Если укол для лечения болезни селезёнки, то укол наклонно вверх. Можно использовать пронизывающий укол (через предплечье) к точке чжи-гоу (TR6), так колют в случае стенокардии.",
	specialInfo: ""
}; 

var neiGuan= {
	name: "Нэй-гуань",
	index: "MC6",
	specificLocation: "на 2 цуня выше лучезапястной складки, между сухожилиями длинной ладонной мышцы и лучевого сгибателя запястья. Используют точку при разогнутой в локтевом суставе руке и обращенной кверху ладони.",
	bodyPart: "",
   symptoms: ["заболевания ло","боль в животе", "боль в грудной клетке", "скорая помощь","боль в сердце", "беспокойство", "боль в кисти", "боль в локте", "боль в безымянном пальце"],
	technique: "Укол перпендикулярный на глубину до 2 см, или пронизывающий укол к точке вай-гуань (при болях в животе или груди - наклонно по руке вверх, на глубину до 4 см.), если использовать как точку скорой помощи требуется совершать интенсивные вращения головкой иглы. Цзю - до 15 минут.",
	specialInfo: ""
}; 

var daLing= {
	name: "Да-лин",
	index: "MC7",
	specificLocation: "ровно посередине лучезапястной складки.",
	bodyPart: "",
   symptoms: ["для охлаждения сердечного огня и успокоения шень", "депрессия", "эпилепсия", "судороги в руках", "ощущение переполнения в грудной клетке", "увеличенные лимфоузлах в подмышечных впадинах", "боль в сердце", "беспокойство", "понос", "запор", "урчание в животе", "ощущение жжения в желудке", "тошнота", "рвота", "изжога", "отёк", "заболевания суставов", "ощущение тяжести в теле"],
	technique: "Укол перпендикулярный на глубину до 1½ см, цзю - до 15 минут. Важно не повредить артерию.",
	specialInfo: ""
}; 

var laoGong= {
	name: "Лао-гун",
	index: "MC8",
	specificLocation: "на середине ладони, между второй и третьей пястными костями, на ладонной складке.",
	bodyPart: "",
   symptoms: ["стенокардия", "нарушения шень", "немотивированные эмоции", "переутомление (переутомлении после тяжёлой работы руками)"],
	technique: "Укол перпендикулярный на глубину до 1см, цзю - до 10 минут. Возможен укол от хэ-гу к лао-гун.",
	specialInfo: ""
}; 

var zhongChong= {
	name: "Чжун-чун",
	index: "MC9",
	specificLocation: "на кончике среднего пальца, на самой дистальной точке пальца.",
	bodyPart: "",
   symptoms: ["скорая помощь", "потеря сознания", "высокая температура", "сердечные боли"],
	technique: "Укол поверхностный, на глубину до 2 мм. В случае использования при синдроме жара добиваются появления капли крови. Цзю - до 3 минут.",
	specialInfo: ""
}; 



var shouJueYinXinBaoLuoJing= {
	name: "канал синь-бао-ло",
	index: "MC",
	channelType: "цзюэ-инь",
	layout: "начинается в грудной клетке, выходит на поверхность в 4 межрёберном промежутке, на 1 цунь латеральнее соска, оттуда поднимается к подмышечной впадине и по внутренней поверхности плеча входит в локтевую складку. По внутренней поверхности предплечья и входит в ладонь, проходя через точку лао-гун, идёт к кончику среднего пальца. От лао-гун идёт ветка к основанию ногтя безымянного пальца, к началу канала сань-цзяо.",
	basicbodyPart: "",
   symptoms: ["сердцебиение", "беспокойство",  "любое расстройство шень", "распирание в грудной клетке", "боль в области сердца", "судороги верхней конечности", "отёк в области лимфоузлов в подмышечной впадине", "“горящее” лицо и руки"],
	luo: neiGuan,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [tianChi, tianQuan, quZe, xiMen, jianShi, neiGuan, daLing, laoGong, zhongChong]
}


/*Xue of the SanJiao channel -  Shou Shao Yang SanJiao Jing*/

var guanChong= {
	name: "Гуань-чун",
	index: "TR1",
	specificLocation: "около угла ногтя безымянного пальца на локтевой стороне, на 2 мм. кнаружи.",
	bodyPart: "",
   symptoms: ["скорая помощь", "нарушения слуха"],
	technique: "Укол на глубину 2 мм, цзю до 10 минут.",
	specialInfo: ""
};

var yeMen= {
	name: "Е-мэнь",
	index: "TR2",
	specificLocation: "на тыльной стороне руки, между 5 и 4 пястно-фаланговыми суставами (безымянного пальца и мизинца).",
	bodyPart: "",
   symptoms: ["головная боль (височная)", "нарушения слуха","боль в зубах", "покраснение глаз", "красное лицо", "нарушения шень, связанные с синдромами жара"],
	technique: "Укол перпендикулярный, на глубину до 1 см, цзю до 5 минут.",
	specialInfo: ""
};

var zhongZhu= {
	name: "Чжун-чжу",
	index: "TR3",
	specificLocation: "на 1 цунь кзади (проксимальнее) точки е-мэнь.",
	bodyPart: "",
   symptoms: ["нарушения слуха", "головная боль (височная)", "суставные боли в верхней конечности"],
	technique: "Укол перпендикулярный, на глубину до 1 см, цзю до 5 минут.",
	specialInfo: ""
};

var yangChi= {
	name: "Ян-чи",
	index: "TR4",
	specificLocation: "на тыльной стороне лучезапястной складки.",
	bodyPart: "",
   symptoms: ["сухожильные боли в районе лучезапястного сустава", "любые нарушения мочеиспускания"],
	technique: "Укол перпендикулярный, на глубину до 1 см, цзю до 10 минут.",
	specialInfo: ""
};

var waiGuan= {
	name: "Вай-гуань",
	index: "TR5",
	specificLocation: "на 2 цуня выше лучезапястной складки.",
	bodyPart: "",
   symptoms: ["проблемы локтевого сустава",  "простуда с высокой температурой и лихорадкой", "нарушения шень (немотивированными эмоциями)", "расстройства ло", "асимметрия лица"],
	technique: "Укол перпендикулярный, на глубину до 2 см, или пронизывающий укол в сторону нэй-гуань на глубину до 3 цуней, цзю до 15 минут. При простудных заболеваниях - глубокий (до 4 см. укол) наклонный в сторону локтя (около 60 градусов).",
	specialInfo: ""
};

var zhiGou= {
	name: "Чжи-гоу",
	index: "TR6",
	specificLocation: "на 3 цуня выше лучезапястной складке, между костями.",
	bodyPart: "",
   symptoms: ["кашель", "одышка", "лихорадочные состояния во время простудных заболеваний", "любые заболевания со свойствами жара", "покраснение лица", "покраснение глаз", "капающее мочеиспускание", "запор", "боль в животе из-за непроходимости кишечника",  "печёночные колики", "непроходимость жёлчных путей", "скорая помощь при дыхательных спазмах",  "немотивированный гнев",  "перепады настроения связанные с климактерическим периодом"],
	technique: "Укол перпендикулярный, на глубину до 2 см, цзю до 10 минут.",
	specialInfo: ""
};

var huiZong= {
	name: "Хуэй-цзун",
	index: "TR7",
	specificLocation: "на уровне точки чжи-гоу, около локтевой кости.",
	bodyPart: "",
   symptoms: ["боль (в основном на предплечьи)", "нарушения слуха"],
	technique: "Укол перпендикулярный, на глубину до 2 см, цзю до 30 минут.",
	specialInfo: ""
};

var sanYangLuo= {
	name: "Сань-ян-ло",
	index: "TR8",
	specificLocation: "на 4 цуня проксимальнее центра лучезапястной складке.",
	bodyPart: "",
   symptoms: ["боль в предплечье"],
	technique: "Укол перпендикулярный, на глубину до 2½ см, цзю до 10 минут.",
	specialInfo: ""
};

var siDu= {
	name: "Сы-ду",
	index: "TR9",
	specificLocation: "на 5 цуней ниже олекранона.",
	bodyPart: "",
   symptoms: ["боль в локте", "воспаление надмыщелков локтевого сустава (при болезнях теннисиста/гольфиста)"],
	technique: "Укол перпендикулярный, на глубину до 3 см, цзю до 10 минут.",
	specialInfo: ""
};

var tianJing= {
	name: "Тянь-цзин",
	index: "TR10",
	specificLocation: "на 1 цунь выше олекранона.",
	bodyPart: "",
   symptoms: ["заболевания связанные с желудком и кишечником (редко)", "высыпания с ощущением зуда (при псориазах и дерматозах/нейродермитах)", "боль в локте"],
	technique: "Укол перпендикулярный, на глубину до 2 см, может быть болезненным, цзю до 10 минут.",
	specialInfo: ""
};

var qingLengYuan= {
	name: "Цин-лэн-юань",
	index: "TR11",
	specificLocation: "на 2 цуня выше олекранона.",
	bodyPart: "",
   symptoms: ["головная боль, связанная со скоплением флегмы", "ограничение движения в локтевом и плечевом суставах"],
	technique: "Укол перпендикулярный, на глубину до 2½ см, цзю до 20 минут.",
	specialInfo: ""
};

var xiaoLuo= {
	name: "Сяо-ло",
	index: "TR12",
	specificLocation: "посередине между точками цин-лэн-юань и нао-хуэй.",
	bodyPart: "",
   symptoms: ["ограничение подвижности в плечевом и локтевом суставах"],
	technique: "Укол перпендикулярный, уточнить глубину цзю до 20 минут.",
	specialInfo: ""
};

var naoHui= {
	name: "Нао-хуэй",
	index: "TR13",
	specificLocation: "у заднего края дельтовидной мышцы, на линии олекранон-акромион.",
	bodyPart: "",
   symptoms: ["ограничение подвижности в плечевом суставе"],
	technique: "Укол перпендикулярный, на глубину до 2½ см,цзю до 20 минут.",
	specialInfo: ""
};

var jianLiao= {
	name: "Цзянь-ляо",
	index: "TR14",
	specificLocation: "возле нижнего края акромиона. При отведении руки в сторону, за акромионом появляется ямка.",
	bodyPart: "",
   symptoms: ["ограничение подвижности и боли в плечевом суставе (действительно используется)"],
	technique: "Укол перпендикулярный, на глубину до 2½ см, цзю до 20 минут. Укол может быть и глубже из-за добавочной жировой или соединительной ткани.",
	specialInfo: ""
};

var tianLiao= {
	name: "Тянь-ляо",
	index: "TR15",
	specificLocation: "в надостной ямке, на 1 цунь ниже точки цзянь-цзин.",
	bodyPart: "",
   symptoms: ["ограничение подвижности и боли в плечевом суставе (действительно используется)"],
	technique: "Укол перпендикулярный, на глубину до 2 см, цзю до 20 минут.",
	specialInfo: ""
};

var tianYou= {
	name: "Тянь-ю",
	index: "TR16",
	specificLocation: "кзади и книзу от сосцевидного отростка, посередине между точками тянь-чжун и тянь-чжу.",
	bodyPart: "",
   symptoms: ["затуманивание зрения", "снижение слуха", "шум в ушах", "заложенность носа", "носовые кровотечения", "напряжение мышц на задней поверхности шеи и в области цзянь"],
	technique: "Укол перпендикулярный, на глубину до 2 см, цзю до 10 минут.",
	specialInfo: ""
};

var yiFeng= {
	name: "И-фэн",
	index: "TR17",
	specificLocation: "между челюстным суставом и сосцевидным отростком, под мочкой уха, при поднятой челюсти.",
	bodyPart: "",
   symptoms: ["нарушения слуха", "невралгия тройничного нерва и её последствиях (асимметрия лица)", "отит (как обычных, так и гнойных)"],
	technique: "Укол перпендикулярный (слегка наклонный в сторону противоположного глаза, если проблема с глазами, слегка книзу, если проблема с носом), на глубину до 2 см, цзю до 20 минут.",
	specialInfo: ""
};

var chiMai= {
	name: "Чи-май",
	index: "TR18",
	specificLocation: "в центре сосцевидного отростка, в месте соединения верхних 2/3 и нижней 1/3 дугообразной линии за ухом между точками И-фэн TR.17 и Цзяо-сунь TR.20.",
	bodyPart: "",
   symptoms: ["детские судороги", "гемикрания"],
	technique: "Укол наклонный в сторону челюсти, от средней линии наружу, на глубину до 1 см, цзю до 5 минут.",
	specialInfo: ""
};

var luXi= {
	name: "Лу-си",
	index: "TR19",
	specificLocation: "в месте соединения верхней 1/3 и нижних 2/3 дугообразной линии за ухом между точками И-фэн TR.17 и Цзяо-сунь TR.20.",
	bodyPart: "",
   symptoms: ["детские судороги", "успокоение духа шень", "расстройства слуха"],
	technique: "Укол горизонтальный, на глубину до 1 см, цзю до 5 минут.",
	specialInfo: ""
};

var jiaoSun= {
	name: "Цзяо-сунь",
	index: "TR20",
	specificLocation: "около верхней части уха, у границы роста волос.",
	bodyPart: "",
   symptoms: ["головная боль в височной части головы", "напряжение мышц в области уха и нижней челюсти"],
	technique: "Укол горизонтальный, по направлению к глазу, на глубину до 1 см, цзю до 10 минут",
	specialInfo: ""
};

var erMen= {
	name: "Эр-мэнь",
	index: "TR21",
	specificLocation: "возле козелка уха, при открытом рте, около точки тин-гун.",
	bodyPart: "",
   symptoms: ["любые заболевания ушей", "снижение слуха", "отит"],
	technique: "Укол перпендикулярный (при открытом рте), на глубину до 2 см, при истечении из уха цзю не делают, в прочих случаях - цзю до 10 минут.",
	specialInfo: ""
};

var heLiao= {
	name: "Хэ-ляо",
	index: "TR22",
	specificLocation: "на линии роста волос, на уровне наружного угла глаза.",
	bodyPart: "",
   symptoms: ["любые заболевания ушей", "гемикрания"],
	technique: "Укол горизонтальный, по направлению к углу глаза, на глубину до 1 см, цзю до 5 минут.",
	specialInfo: ""
};

var siZhuKong= {
	name: "Сы-чжу-кун",
	index: "TR23",
	specificLocation: "в небольшом углублении в кости, около наружного угла брови.",
	bodyPart: "",
   symptoms: ["головная боль (височная)"],
	technique: "Укол горизонтальный сверху вниз на глубину до 1 см., не прижигают.",
	specialInfo: ""
};


var shouShaoYangSanJiaoJing= {
	name: "канал сань-цзяо",
	index: "TR",
	channelType: "шао-ян",
	layout: "начинается возле ногтевого ложа безымянного пальца, с локтевой стороне. Идёт по тыльной стороне предплечья и плеча. Около плечевого сустава проходит через точку да-чжуй (под 7 шейным позвонком). От да-чжуй ныряет внутрь и внутренним ходом соединяется с точкой тан-чжун(центр груди). Там он связывается с каналом синь-бао-ло и проходит через все области сань-цзяо. От тан-чжун вторая ветка поднимается через шею к уху и там соединяется с каналом желчного пузыря и оттуда, через щёку приходит к наружному уголку глаза. Под ухом соединяется с каналом тонкой кишки в точке тин-гун. В конечной точке (сы-чжу-кун) также происходит соединение с каналом тонкой кишки (точкой тун-цзы-ляо, точки находятся одна под другой и являются последней и первой на своём канале соответственно).",
	basicbodyPart: "",
   symptoms: ["нарушение слуха", "боль в наружном углу глаза", "боль в горле", "боль в области цзянь", "боль в плече", "боль в локте", "боль в предплечьи", "нарушения в 4 пальце руки."],
	luo: "waiGuan",
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [guanChong, yeMen, zhongZhu, yangChi, waiGuan, zhiGou, huiZong, sanYangLuo, siDu, tianJing, qingLengYuan, xiaoLuo, naoHui, jianLiao, tianLiao, tianYou, yiFeng, chiMai, luXi, jiaoSun, erMen, heLiao, siZhuKong]
}


/*Xue of the Gallbladder channel - Ju Shao Yang Dan Jing*/

var tongZiLiao= {
	name: "Тун-цзы-ляо",
	index: "VB1",
	specificLocation: "на уровне зрачка смотрящего прямо, в ямке за краем орбиты глаза.",
	bodyPart: "",
   symptoms: ["любые заболевания глаз", "головная боль (височная)"],
	technique: "Укол горизонтальный кнаружи, на глубину до 1 см., цзю до 10 минут.",
	specialInfo: ""
};

var tingHui= {
	name: "Тин-хуэй",
	index: "VB2",
	specificLocation: "кпереди от межкозелковой вырезки, определяестя при открытом рте.",
	bodyPart: "",
   symptoms: ["любые нарушениях слуха", "любые виды шума в ушах", "асимметрия лица", "нарушение работы жевательных мышц", "пациент прикусывает щёку изнутри"],
	technique: "Укол перпендикулярный, на глубину до 2 см., при приоткрытом рте, цзю до 15 минут.",
	specialInfo: ""
};

var shangGuan= {
	name: "Шан-гуань",
	index: "VB3",
	specificLocation: "выше точки ся-гуань, ниже точки тай-ян, на скуловой дуге.",
	bodyPart: "",
   symptoms: ["нарушения слуха", "нарушения жевания", "нарушения зрения", "зубная боль в коренных зубах верхней челюсти"],
	technique: "Укол перпендикулярный, на глубину (в зависимости от телосложения) до 1½ см. (но может быть и меньше). Цзю - до 10 минут. Следует опасаться слишком глубокого укола.",
	specialInfo: ""
};

var hanYan= {
	name: "Хань-янь",
	index: "VB4",
	specificLocation: "на линии от точки тоу-вэй, к уху (точке ушная шень-мэнь), на ⅕ длины этой линии.",
	bodyPart: "",
   symptoms: ["аномальное поднятие ян печени", "гемикрания"],
	technique: "Укол горизонтальный, по направлению к затылку, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: "" 
};

var xuanLu= {
	name: "Сюань-лу",
	index: "VB5",
	specificLocation: "на линии от точки тоу-вэй, к уху (точке ушная шень-мэнь), на ⅖ длины этой линии.",
	bodyPart: "",
   symptoms: ["гемикрания"],
	technique: "Укол горизонтальный, по направлению к затылку, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var xuanLi= {
	name: "Сюань-ли",
	index: "VB6",
	specificLocation: "на линии от точки тоу-вэй, к уху (точке ушная шень-мэнь), на ⅗ длины этой линии.",
	bodyPart: "",
   symptoms: ["гемикрания"],
	technique: "Укол горизонтальный, по направлению к затылку, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var quBin= {
	name: "Цюй-бинь",
	index: "VB7",
	specificLocation: "на линии от точки тоу-вэй, к уху (точке ушная шень-мэнь), на ⅘ длины этой линии.",
	bodyPart: "",
   symptoms: ["гемикрания", "очень высокое кровяное давление (при апоплексическом ударе, резком приливе крови к голове), укол приводит к резкому падению давления"],
	technique: "Укол горизонтальный, по направлению к затылку, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var shuaiGu= {
	name: "Шуай-гу",
	index: "VB8",
	specificLocation: "на 1½ цуня вверх от верхушки уха.",
	bodyPart: "",
   symptoms: ["снятие острого опьянения", "головная боль (в боковой части головы)"],
	technique: "Укол горизонтальный, по направлению к затылку, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var tianChong= {
	name: "Тянь-чун",
	index: "VB9",
	specificLocation: "на ½ цуня кзади от точки шуай-гу.",
	bodyPart: "",
   symptoms: ["головная боль (в боковой части головы)"],
	technique: "Укол горизонтальный, по направлению к затылку, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var fuBai= {
	name: "Фу-бай",
	index: "VB10",
	specificLocation: "на дуге параллельной краю ушной раковины, на расстоянии 1½ цуня от неё (от точки над верхушкой уха и до сосцевидного отростка), на ⅓ длины от начала.",
	bodyPart: "",
   symptoms: ["простуды, связанные с проникновением патогенной ци", "лихорадка", "озноб", "головная боль", "боль в горле", "кашель", "одышка", "ощущение переполнения в грудной клетке"],
	technique: "Укол горизонтальный, по направлению к затылку, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var touQiaoYin= {
	name: "Тоу-цяо-инь",
	index: "VB11",
	specificLocation: "на дуге параллельной краю ушной раковины, на расстоянии 1½ цуня от неё (от точки над верхушкой уха и до сосцевидного отростка), на ⅔ длины от начала.",
	bodyPart: "",
   symptoms: ["заболевания органов слуха, обоняния и зрения (редко)", "если при простуде боль в голове отдаёт из затылка в основание черепа"],
	technique: "Укол горизонтальный сверху вниз, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var wanGu= {
	name: "Вань-гу",
	index: "VB12",
	specificLocation: "под сосцевидным отростком.",
	bodyPart: "",
   symptoms: ["проникновение патогенной ци в голову"],
	technique: "Укол наклонный сверху вниз, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var benShen= {
	name: "Бэнь-шень",
	index: "VB13",
	specificLocation: "на 3 цуня в бок от средней линии, на линии роста волос.",
	bodyPart: "",
   symptoms: ["психические расстройства (редко)"],
	technique: "Укол горизонтальный, в сторону , на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var yangBai= {
	name: "Ян-бай",
	index: "VB14",
	specificLocation: "в плоскости сечения проходящей через зрачок смотрящий прямо, но не на цунь ниже края орбиты, а 1 цунь выше брови.",
	bodyPart: "",
   symptoms: ["нарушения симметрии в работе мимических мышц", "проникновение патогенной ци ветра, сопровождающейся борьбой между патогенной ци и вай-ци"],
	technique: "Укол горизонтальный, кпереди , на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var touLinQi= {
	name: "Тоу-линь-ци",
	index: "VB15",
	specificLocation: "на уровне зрачка, смотрящего прямо, на ½ цуня выше границы роста волос.",
	bodyPart: "",
   symptoms: ["если от ветра текут слёзы",  "лихорадка из-за ветра"],
	technique: "Укол горизонтальный, кпереди , на глубину до 1 см. Цзю до 10 минут. При слезотечении и повышенной температуре, следует колоть с появлением капли крови.",
	specialInfo: ""
};

var muChuang= {
	name: "Му-чуа",
	index: "VB16",
	specificLocation: "на уровне зрачка смотрящего прямо, на 1 цунь выше точки тоу-линь-ци.",
	bodyPart: "",
   symptoms: ["проникновении патогенной ци ветра"],
	technique: "Укол горизонтальный, кпереди , на глубину до 1 см. Цзю до 10 минут. При слезотечении и повышенной температуре, следует колоть с появлением капли крови.",
	specialInfo: ""
};

var zhengYing= {
	name: "Чжэн-ин",
	index: "VB17",
	specificLocation: "на уровне зрачка смотрящего прямо, на 1 цунь выше точки му-чуа.",
	bodyPart: "",
   symptoms: ["затуманивание зрения", "синдром ветра холода"],
	technique: "Укол горизонтальный, кпереди , на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var chengLing= {
	name: "Чэн-лин",
	index: "VB18",
	specificLocation: "Располагается  на уровне зрачка смотрящего прямо, на 1½ цуня выше точки чжэн-ин.",
	bodyPart: "",
   symptoms: ["синдром ветра холода"],
	technique: "Укол горизонтальный, кпереди , на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var naoKong= {
	name: "Нао-кун",
	index: "VB19",
	specificLocation: "на 1½ цуня выше точки фэн-чи.",
	bodyPart: "",
   symptoms: ["боль в затылке", "ригидность мышц шеи и затылка"],
	technique: "Укол горизонтальный, кпереди , на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var fengChi= {
	name: "Фэн-чи",
	index: "VB20",
	specificLocation: "под затылочной костью, в точке между прикреплениями грудинно-ключично-сосцевидной мышцы и трапеции, на 2½ цуня в сторону от средней линии.",
	bodyPart: "",
   symptoms: ["проникновение патогенной ци ветра", "проникновении патогенной ци в голову", "боль в затылке", "повышенное давление"],
	technique: "Укол почти перпендикулярный, по направлению к носу, или противоположному глазу, на глубину до 2½ см. Цзю до 10 минут.",
	specialInfo: "Основная точка"
};

var jianJing= {
	name: "Цзянь-цзин",
	index: "VB21",
	specificLocation: "на середине линии от акромиона до края остистого отростка C7.",
	bodyPart: "",
   symptoms: ["любые проблемы связанные с плечевым суставом", "любые неврологические расстройствами верхней конечности", "задержка плаценты после родов", "для стимуляции родов", "мастит", "мастопатия", "для повышения лактации", "хронический кашель", "головная боль (височная)", "апоплексия"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Цзю до 30 минут.",
	specialInfo: "Не колют в период беременности, за исключением поздних сроков"
};

var yuanYe= {
	name: "Юань-е",
	index: "VB22",
	specificLocation: "на мышечной линии в 4 межрёберном промежутке. Находится при поднятой руке.",
	bodyPart: "",
   symptoms: ["распирание в грудной клетке", "кашель (при застойных явлениях)"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Цзю не применяют.",
	specialInfo: ""
};

var zheJin= {
	name: "Чжэ-цзинь",
	index: "VB23",
	specificLocation: "на 1 цунь кпереди от точки юань-е. Находится при поднятой руке.",
	bodyPart: "",
   symptoms: ["распирание в грудной клетке", "кашель (при застойных явлениях)", "ощущение горечи во рту (редко)"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var riYue= {
	name: "Жи-юэ",
	index: "VB24",
	specificLocation: "прямо вниз от соска, в VII межреберном промежутке, на 1 ребро прямо вниз от точки Ци-мэнь F.14.",
	bodyPart: "",
   symptoms: ["ощущение горечи во рту", "сырость-жар в печени", "сырость-жар в селезёнке"],
	technique: "Укол наклонный , сверху вниз, на глубину до 1½ см. Цзю до 20 минут.",
	specialInfo: ""
};

var jingMen= {
	name: "Цзин-мэнь",
	index: "VB25",
	specificLocation: "возле свободного края свободного ребра.",
	bodyPart: "",
   symptoms: ["отёк", "сухость", "запор", "понос", "нарушения мочеиспускания"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до ½ часа.",
	specialInfo: ""
};

var daiMai= {
	name: "Дай-май",
	index: "VB26",
	specificLocation: "на вертикальной линии от края 12 ребра, на уровне пупка.",
	bodyPart: "",
   symptoms: ["гинекологические расстройства","дисменорея", "аменорея", "бели"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 15 минут. ",
	specialInfo: ""
};

var wuShu= {
	name: "У-шу",
	index: "VB27",
	specificLocation: "на уровне точки гуань-юань (на середине расстояния между пупком и лобковой костью), там где горизонтальная плоскость в гуань-юань пересекает передний край подвздошной кости.",
	bodyPart: "",
   symptoms: ["различные гинекологические заболевания (редко)"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 30 минут.",
	specialInfo: ""
};

var weiDao= {
	name: "Вэй-дао",
	index: "VB28",
	specificLocation: "на ½ цуня вперёд и вниз от точки у-шу.",
	bodyPart: "",
   symptoms: ["различные гинекологические заболевания (редко)"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 30 минут.",
	specialInfo: ""
};

var juLiao= {
	name: "Цзюй-ляо",
	index: "VB29",
	specificLocation: "на (паховой) складке, от большого вертела  вверх к подвздошной кости, на уровне середины гребня подвздошной кости.",
	bodyPart: "",
   symptoms: ["боль в тазобедренном суставе"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 15 минут.",
	specialInfo: ""
};

var huanTiao= {
	name: "Хуань-тяо",
	index: "VB30",
	specificLocation: "на линии от большого вертела к вершине вертикальной ягодичной складки, одной трети расстояния между этими точками от большого вертела.",
	bodyPart: "",
   symptoms: ["расстройство тазобедренного сустава", "расстройство седалищного нерва"],
	technique: "Укол перпендикулярный, на глубину до 7 см. Цзю до 30 минут.",
	specialInfo: "Основная точка"
};

var fengShi= {
	name: "Фэн-ши",
	index: "VB31",
	specificLocation: "Когда человек стоит, средний палец опущенной руки попадает в эту точку. От края подколенной складки, по боковой линии на 7 цуней вверх.",
	bodyPart: "",
   symptoms: ["проблемы седалищного нерва", "боль в бедре", "боль в колене", "боль в тазобедренном суставе",  "крапивница"],
	technique: "Укол перпендикулярный, на глубину до 4 см. Цзю до 20 минут. Укалывают, когда пациент лежит на животе.",
	specialInfo: ""
};

var zhongDu= {
	name: "Чжун-ду",
	index: "VB32",
	specificLocation: "на 2 цуня ниже точки фэн-ши.",
	bodyPart: "",
   symptoms: ["парестезия латеральной поверхности голени, по ходу малоберцового нерва (редко)"],
	technique: "Укол перпендикулярный, на глубину до 4 см. Цзю до 20 минут.",
	specialInfo: ""
};

var xiYangGuan= {
	name: "Си-ян-гуань",
	index: "VB33",
	specificLocation: "на 3 цуня выше точки ян-лин-цюань.",
	bodyPart: "",
   symptoms: ["боль в колене", "нарушение подвижности коленного сустава", "парестезия латеральной поверхности голени", "поражение двигательных нервов голени"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю делают очень коротким и не используют глубокого прогревания, а используют утюжащий приём.",
	specialInfo: ""
};

var yangLingQuan= {
	name: "Ян-лин-цюань",
	index: "VB34",
	specificLocation: "около латерального края расширения малоберцовой кости (следует соскользнуть с края расширения в сторону икроножной мышцы).",
	bodyPart: "",
   symptoms: ["жар в печени", "заболевания органов ян", "слабость при сгибании и разгибании любых суставов", "слабость в суставах (особенно при простудах)", "проблемы опорно-двигательного аппарата", "синдром сырости-жара"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 20 минут. Можно использовать пронизывающий укол по направлению к точке инь-лин-цюань (в случае отёка коленного сустава), в этом случае укол на глубину 6 см. В случае слабости суставов колют в сочетании с точками сюань-чжун и да-чжу.",
	specialInfo: ""
};

var yangJiao= {
	name: "Ян-цзяо",
	index: "VB35",
	specificLocation: "на 7 цуней (2+2+3) вверх от латеральной лодыжки. Следует отложить 7 цуней по краю кости и затем соскользнуть латеральнее.",
	bodyPart: "",
   symptoms: ["начальный этап проникновения патогенной ци в организм", "борьба между патогенной ци и вэй-ци", "проблемы в области голени"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 20 минут.",
	specialInfo: ""
};

var waiQiu= {
	name: "Вай-цю",
	index: "VB36",
	specificLocation: "на 7 цуней вверх от латеральной лодыжки, кпереди от малоберцовой кости.",
	bodyPart: "",
   symptoms: ["боль по ходу канала", "парестезия в области точки"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 20 минут.",
	specialInfo: ""
};

var guangMing= {
	name: "Гуан-мин",
	index: "VB37",
	specificLocation: "на 5 цуней выше латеральной лодыжки, возле переднего края малоберцовой кости.",
	bodyPart: "",
   symptoms: ["заболевания ло", "нарушениях зрения (конъюнктивит)"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 20 минут.",
	specialInfo: ""
};

var yangFu= {
	name: "Ян-фу",
	index: "VB38",
	specificLocation: "на  4 цуня выше латеральной лодыжки, кпереди от края малоберцовой кости.",
	bodyPart: "",
   symptoms: ["для охлаждения огня печени и жёлчного","лихорадка", "озноб", "кашель", "боль в горле", "ангина"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 20 минут.",
	specialInfo: ""
};

var xuanZhong= {
	name: "Сюань-чжун",
	index: "VB39",
	specificLocation: "на 3 цуня выше латеральной лодыжки, кпереди от края малоберцовой кости.",
	bodyPart: "",
   symptoms: ["слабость в суставах", "паралич", "ощущение онемения и слабости в нижней конечности (особенно - в стопе)", "прединсультное состояние", "боль в голени"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 10 минут. При боли в голени - пронизывающий укол по направлению к точке сань-инь-цзяо, на глубину 4 см.",
	specialInfo: ""
};

var qiuXu= {
	name: "Цю-сюй",
	index: "VB40",
	specificLocation: "ниже латеральной лодыжки.",
	bodyPart: "",
   symptoms: ["любые заболевания канала желчного пузыря", "боль в груди", "боль в надключичной ямке", "боль в горле"],
	technique: "Укол перпендикулярный, на глубину до 1½  см. Цзю до 10 минут.",
	specialInfo: ""
};

var zuLinQi= {
	name: "Цзу-линь-ци",
	index: "VB41",
	specificLocation: "возле разгибателя мизинца, между 4 и 5 плюсневыми костями, на 1½ цуня выше точки ся-си.",
	bodyPart: "",
   symptoms: ["тяжесть в теле", "боль в суставах"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var diWuHui= {
	name: "Ди-у-хуэй",
	index: "VB42",
	specificLocation: "на 1 цунь выше точки ся-си.",
	bodyPart: "",
   symptoms: ["отёк стопы"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Не прижигают.",
	specialInfo: ""
};

var xiaXi= {
	name: "Ся-си",
	index: "VB43",
	specificLocation: "на краю складки между 4 и 5 пальцем.",
	bodyPart: "",
   symptoms: ["любые болезни жара"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var zuQiaoYin= {
	name: "Цзу-цяо-инь",
	index: "VB44",
	specificLocation: "на наружной стороне IV пальца стопы, приблизительно на 0,1 цуня от угла ногтя.",
	bodyPart: "",
   symptoms: ["скорая помощь", "ощущение распирания в голове", "покраснение глаз", "раздражение горла", "горечь во рту", "немотивированный гнев","повышенное давление"],
	technique: "Поверхностный укол на глубину до 2 мм. Цзю до 10 минут.",
	specialInfo: ""
};

var zuShaoYangDanJing= {
	name: "канал жёлчного пузыря",
	index: "VB",
	channelType: "шао-ян",
	layout: "начинается возле наружного угла глаза в точке тун-цзы-ляо. Одна ветка идёт через висок к затылочной кости и проходит через верхушку уха к сосцевидному отростку, проходит через точку фэн-чи и идёт к точке да-чжуй (как и все янский каналы). Затем входит в ухо и идёт сзади от глаза в точку шан-гуань. Другая ветка опускается к нижней челюсти, идёт по шее, входит в надключичную ямку, входит в печень и жёлчный пузырь и через паховую складку и лобок идёт к точке хуань-тяо. От этой точки идёт по наружной поверхности бедра, голени и входит в 4 палец стопы, где и заканчивается.",
	basicbodyPart: "",
   symptoms: ["ощущение горечи во рту", "боль в подреберьи", "боль в боковой части живота (больно если пытаешься скрутиться)", "жар в наружной части стопы", "потеря чувствительности 4 пальца."],
	luo: "guangMing",
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [tongZiLiao, tingHui, shangGuan, hanYan, xuanLu, xuanLi, quBin, shuaiGu, tianChong, fuBai, touQiaoYin, wanGu, benShen, yangBai, touLinQi, muChuang, zhengYing, chengLing, naoKong, fengChi, jianJing, yuanYe, zheJin, riYue, jingMen, daiMai, wuShu, weiDao, juLiao, huanTiao, fengShi, zhongDu, xiYangGuan, yangLingQuan, yangJiao, waiQiu, guangMing, yangFu, xuanZhong, qiuXu, zuLinQi, diWuHui, xiaXi, zuQiaoYin]
}


/*Xue of the Liver channel - Ju Jue Yin Gan Jing*/

var daDun= {
	name: "Да-дунь",
	index: "F1",
	specificLocation: "на 1 мм от угла ногтевого ложа на латеральной стороне большого пальца ноги.",
	bodyPart: "",
   symptoms: ["скорая помощь", "застой или гиперактивность ци печени", "боль в половых органах", "отёк половых органов"],
	technique: "Укол на глубину до 2-3 мм, до появления капли крови (если речь идёт об погашении огня печени). Цзю до 10 минут.",
	specialInfo: ""
};

var xingJian= {
	name: "Син-цзянь",
	index: "F2",
	specificLocation: "на краю складки между первым и вторым пальцем ноги.",
	bodyPart: "",
   symptoms: ["болезни со свойствами жара", "застой или гиперактивность ян печени", "воспаление глаз", "сухость и резь в глазах", "головная боль отдающая в глаза", "расстройства месячных, связанных с иссушением жидкости (дисменорея, аменорея)"],
	technique: "",
	specialInfo: ""
};

var taiChong= {
	name: "Тай-чун",
	index: "F3",
	specificLocation: "в месте схождения первой и второй плюсневых костей.",
	bodyPart: "",
   symptoms: ["все болезни печени и жёлчного", "боль в половых органах", "возгорание огня печени", "глазные заболевания", "любые простуды, связанные с патогенной ци ветра."],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 15 минут. В случае использования в качестве точки скорой помощи можно использовать пронизывающий укол к точке юн-цюань. ",
	specialInfo: ""
};

var zhongFeng= {
	name: "Чжун-фэн",
	index: "F4",
	specificLocation: "на 1 цунь кпереди от медиальной лодыжки. Следует колоть при разогнутой стопе, если стопу максимально разогнуть, то в месте точки образуется складка между двумя сухожилиями.",
	bodyPart: "",
   symptoms: ["ощущение недостатка воздуха при дыхании (при недостаточной сатурации, вызванной недостатком ци печени)", "нарушение подвижности в голеностопе"],
	technique: "Укол перпендикулярный на глубину до 1½ см. Цзю до 15 минут.",
	specialInfo: ""
};

var liGou= {
	name: "Ли-гоу",
	index: "F5",
	specificLocation: "на 5 цуней выше медиальной лодыжки. В этом месте на поверхности большеберцовой кости есть углубление (правда его обычно тяжело нащупать из-за обилия мышц вокруг).",
	bodyPart: "",
   symptoms: ["нарушения ло"],
	technique: "Укол поверхностный, снизу вверх, на глубину до 4 см (вдоль канавки на кости). Цзю до 5 минут.",
	specialInfo: ""
};

var footZhongDu= {
	name: "Чжун-ду",
	index: "F6",
	specificLocation: "на 2 цуня выше, точки ли-гоу.",
	bodyPart: "",
   symptoms: ["любые нарушения месячных", "кровавый понос", "запор с кровью"],
	technique: "Укол поверхностный (уточнить), на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var xiGuan= {
	name: "Си-гуань",
	index: "F7",
	specificLocation: "на 1 цунь кзади от точки инь-лин-цюань",
	bodyPart: "",
   symptoms: ["заболевания колена"],
	technique: "Укол перпендикулярный на глубину до 3 см. Цзю до 15 минут.",
	specialInfo: ""
};

var quQuan= {
	name: "Цюй-цюань",
	index: "F8",
	specificLocation: "возле медиального конца подколенной складки.",
	bodyPart: "",
   symptoms: ["синдром сырости-жара в мочеполовой системе", "понос с остатками непереваренной пищи", "заболевания коленного сустава"],
	technique: "Укол перпендикулярный на глубину до 3 см (или глубже, в зависимости от комплекции пациента). Цзю до 15 минут.",
	specialInfo: ""
};

var yinBao= {
	name: "Инь-бао",
	index: "F9",
	specificLocation: "на 4 цуня выше медиального мыщелка бедренной кости, у заднего края портняжной мышцы.",
	bodyPart: "",
   symptoms: ["для нормализации месячных"],
	technique: "Укол перпендикулярный на глубину до 4 см. Цзю до 20 минут.",
	specialInfo: ""
};

var femurWuLi= {
	name: "Цзу-у-ли",
	index: "F10",
	specificLocation: "на медиальной поверхности ноги, на уровне малого вертела, на 3 цуня ниже точки ци-чун.",
	bodyPart: "",
   symptoms: ["ощущение переполнения в животе (крайне редко)", "экзема мошонки (крайне редко)"],
	technique: "Укол перпендикулярный на глубину до 4 см. Цзю до 10 минут.",
	specialInfo: ""
};

var yinLian= {
	name: "Инь-лянь",
	index: "F11",
	specificLocation: "на лобковой кости, на 2 цуня кнаружи и 2 цуня вниз от точки цюй-гу.",
	bodyPart: "",
   symptoms: ["сложности зачатия у женщины", "зуд и раздражение внешних половых органов"],
	technique: "Укол перпендикулярный на глубину до 4 см. Цзю до 10 минут.",
	specialInfo: ""
};

var jiMai= {
	name: "Цзи-май",
	index: "F12",
	specificLocation: "на 2½ цуня латеральнее нижнего края лобкового симфиза (следует соскользнуть с лобковой кости и затем откладывать), в этом месте хорошо ощущается пульс.",
	bodyPart: "",
   symptoms: ["выпадение матки", "боль в паху", "паховая грыжа"],
	technique: "Укол перпендикулярный на глубину до 1 см. Цзю до 10 минут. Следует колоть очень аккуратно, так как есть высокий шанс повредить артерию, у которой нет точного пути пролегания.",
	specialInfo: ""
};

var zhangMen= {
	name: "Чжан-мэнь",
	index: "F13",
	specificLocation: "у края 11 ребра, определяется лёжа на боку, при выпрямленной нижней и согнутой верхней ноге, верхнюю руку следует поднять вверх.",
	bodyPart: "",
   symptoms: ["для восполнения ци селезёнки"],
	technique: "Укол перпендикулярный на глубину до 2 см. Цзю до 10 минут.",
	specialInfo: ""
};

var qiMen= {
	name: "Ци-мэнь",
	index: "F14",
	specificLocation: "в 6 межрёберном промежутке, на уровне соска.",
	bodyPart: "",
   symptoms: ["для восстановления циркуляции ци в канале", "нарушения ци печени", "синдром жара в матке"],
	technique: "Укол наклонно к ребру, на глубину до 4 см. Цзю до 10 минут.",
	specialInfo: ""
};



var zuJueYinGanJing= {
	name: "канал печени",
	index: "F",
	channelType: "цзюэ-инь",
	layout: "начинается около ногтя большого пальца ноги. Пересекается в точке сань-инь-цзяо (пересечение 3 ножных инь). Канал печени огибает половые органы, поэтому часто используется при проблемах мочеполовой сферы. Затем он ныряет в туловище и там заканчивается (под грудью). Внутренним ходом он связан с глазами, с точкой бай-хуэй, от глаз опускается ко рту и огибает рот через латеральную мимическую носогубную складку (симметрично).",
	basicbodyPart: "",
   symptoms: ["паховая боль", "энурез"],// "задержка мочеиспускания", "капающее мочеиспускание", "ощущение сухости в горле" "чувство распирания в груди", "понос с кусочками непереваренной пищи", "отёк тыльной поверхности стопы", "проникновение огня печени в тело"],
	luo: liGou,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [daDun, xingJian, taiChong, zhongFeng, liGou, footZhongDu, xiGuan, quQuan, yinBao, femurWuLi, yinLian, jiMai, zhangMen, qiMen]
}


/*Xue of the Governor vessel - Du Mai*/

var changQiang= {
	name: "Чан-цян",
	index: "T1",
	specificLocation: "на ½ цуня ниже копчика (следует пальцем соскользнуть с копчика). Точку укалывают когда пациент лежит на животе.",
	bodyPart: "",
   symptoms: ["нарушения психики", "бесплодие", "геморрой", "выпадение прямой кишки"],
	technique: "Укол по направлению вдоль внутреннего изгиба копчика (таким образом укол идёт слегка снизу-вверх), на глубину до 2 см. Цзю до 15 минут. Имеет абортивное действие.",
	specialInfo: ""
};

var yaoShu= {
	name: "Яо-шу",
	index: "T2",
	specificLocation: "на пояснице, на уровне нижнего крестцового отверстия (чуть ниже).",
	bodyPart: "",
   symptoms: ["перенапряжение мышц поясницы", "ревматизм"],
	technique: "Укол наклонный снизу вверх на глубину до 1 см. Цзю до 15 минут.",
	specialInfo: ""
};

var yaoYangGuan= {
	name: "Яо-ян-гуань",
	index: "T3",
	specificLocation: "под остистым отростком 4 поясничного позвонка.",
	bodyPart: "",
   symptoms: ["боль в пояснице (редко)"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 20 минут.",
	specialInfo: ""
};

var mingMen= {
	name: "Мин-мэнь",
	index: "T4",
	specificLocation: "посередине между точками шень-шу, под остистым отростком 2 поясничного позвонка.",
	bodyPart: "",
   symptoms: ["любой синдром пустоты (недостаток ци)", "после затяжной болезни", "истощение и отхождении ци"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 40 минут.",
	specialInfo: ""
};

var xuanShu= {
	name: "Сюань-шу",
	index: "T5",
	specificLocation: "под остистым отростком 1 поясничного позвонка.",
	bodyPart: "",
   symptoms: ["синдром пустоты желудка или селезёнки"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 30 минут.",
	specialInfo: ""
};

var jiZhong= {
	name: "Цзи-чжун",
	index: "T6",
	specificLocation: "под остистым отростком 11 грудного позвонка, между точками пи-шу.",
	bodyPart: "",
   symptoms: ["слабость", "несварение", "отсутствие аппетита"],
	technique: "Укол перпендикулярный, на глубину до 4 см. Цзю не используют.",
	specialInfo: ""
};

var zhongShu= {
	name: "Чжун-шу",
	index: "T7",
	specificLocation: "под остистым отростком 10 грудного позвонка, между точками .",
	bodyPart: "",
   symptoms: ["перенапряжение мышц спины"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 20 минут.",
	specialInfo: ""
};

var jinSuo= {
	name: "Цзинь-со",
	index: "T8",
	specificLocation: "под остистым отростком 9 грудного позвонка, между точками гань-шу.",
	bodyPart: "",
   symptoms: ["судороги, особенно ночные", "перенапряжённые мышцы спины"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 20 минут.",
	specialInfo: ""
};

var zhiYang= {
	name: "Чжи-ян",
	index: "T9",
	specificLocation: "под остистым отростком 7 грудного позвонка, между точками сочувствия диафрагме.",
	bodyPart: "",
   symptoms: ["перенапряжённые мышцы позвоночника", "простуда (только цзю)"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
};

var lingTai= {
	name: "Лин-тай",
	index: "T10",
	specificLocation: "под остистым отростком 6 грудного позвонка.",
	bodyPart: "",
   symptoms: ["фурункулёз"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 30 минут.",
	specialInfo: ""
};

var shenDao= {
	name: "Шень-дао",
	index: "T11",
	specificLocation: "под остистым отростком 5 грудного позвонка, между точками синь-шу.",
	bodyPart: "",
   symptoms: ["немотивированные эмоции", "мотивированные, но длительных эмоции (например, депрессия)", "нарушения внимания", "нарушения памяти", "нарушения сна"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 30 минут.",
	specialInfo: ""
};

var shenZhu= {
	name: "Шень-чжу",
	index: "T12",
	specificLocation: "под остистым отростком 3 грудного позвонка",
	bodyPart: "",
   symptoms: ["напряжённые мышцы спины", "очень сильный гнев, доходящий до готовности убить (раньше)", "фурункулёз"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 15 минут.",
	specialInfo: ""
};

var taoDao= {
	name: "Тао-дао",
	index: "T13",
	specificLocation: "под остистым отростком 1 грудного позвонка. ",
	bodyPart: "",
   symptoms: ["борьба между вей-ци и патогенной ци (начало наружного синдрома)"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 10 минут.",
	specialInfo: ""
};

var daZhu= {
	name: "Да-чжуй",
	index: "T14",
	specificLocation: "под остистым отростком 7 шейного позвонка.",
	bodyPart: "",
   symptoms: ["поверхностный синдром, связанных с простудой", "поверхностный синдром ветра жара и вообще синдромы жара", "для нормализации шень при синдромах жара", "потеря крови", "обильные менструации", "любые нарушения связанные с дыханием", "климактерические синдромы (“приливы”)", "болезни горла"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 40 минут.",
	specialInfo: ""
};

var yaMen= {
	name: "Я-мэнь",
	index: "T15",
	specificLocation: "на ½ цуня выше границы роста волос, под остистым 1 шейного позвонка.",
	bodyPart: "",
   symptoms: ["затруднение речи", "скованность языка", "поверхностный синдроме, “когда озноб и жар вызывают большие страдания”", "сильная лихорадка без пота", "избыток ян-жара"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю не используется. Следует колоть аккуратно и избегать излишне глубокого укалывания",
	specialInfo: ""
};

var fengFu= {
	name: "Фэн-фу",
	index: "T16",
	specificLocation: "между точками фэн-чи, на задней срединной линии, на 1 цунь выше задней границы роста волос, в углублении между трапециевидными мышцами, между затылочной костью и I шейным позвонком.",
	bodyPart: "",
   symptoms: ["вместе с точкой фэн-чи при тех же симптомах"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю не используется. Следует колоть аккуратно и избегать излишне глубокого укалывания.",
	specialInfo: ""
};

var naoHu= {
	name: "Нао-ху",
	index: "T17",
	specificLocation: "на задней срединной линии, на 2,5 цуня выше задней границы роста волос, на 1,5 цуня выше точки Фэн-фу VG.16, в углублении у верхнего края наружного затылочного выступа.",
	bodyPart: "",
   symptoms: ["нарушения зрения", "ригидность мышц шеи"],
	technique: "укол вдоль кожи сверху вниз, на глубину до 1 см., или укол от середины наружу, на глубину до 2 см. Цзю не используется.",
	specialInfo: ""
};

var qiangJian= {
	name: "Цян-цзянь",
	index: "T18",
	specificLocation: "между точками фэн-фу и бай-хуэй, на 4 цуня выше задней границы роста волос, на 1,5 цуня выше точки но-ху",
	bodyPart: "",
   symptoms: ["успокоение шень (редко)"],
	technique: "Укол поверхностный, по направлению к точке бай-хуэй, на глубину до 1 см., цзю до 10 минут.",
	specialInfo: ""
};

var houDing= {
	name: "Хоу-дин",
	index: "T19",
	specificLocation: "на 1½ цуня кзади от точки бай-хуэй.",
	bodyPart: "",
   symptoms: ["головокружение", "боль в теменной части головы"],
	technique: "Укол поверхностный, по направлению к точке бай-хуэй, на глубину до ½ см., цзю до 10 минут.",
	specialInfo: ""
};

var baiHui= {
	name: "Бай-хуэй",
	index: "T20",
	specificLocation: "на пересечении сагиттальной плоскости и линии, которая проходит через мочки и вершины ушей, по поверхности головы. 5 цуней от передней границы роста волос (или 7 от задней).",
	bodyPart: "",
   symptoms: ["головокружение", "головная боль (теменная)", "затуманивание зрения", "шум в ушах", "ощущение слабости в теле", "потоотделение (даже при низкой физической активности)", "затяжной понос (неделя и более)", "энурез", "выпадение прямой кишки", "опущение матки", "проникновение патогенной ци холода-ветра", "резкие перепады настроения (и других расстройствах шень)"],
	technique: "Укол поверхностный, либо кпереди, либо кзади, на глубину до 1 см., цзю до 20 минут.Цянь-дин",
	specialInfo: ""
};

var qianDing= {
	name: "Цянь-дин",
	index: "T21",
	specificLocation: "на 1½ цуня кпереди от точки бай-хуэй.",
	bodyPart: "",
   symptoms: ["головная боль (теменная)", "головная боль, связанная с восприятием патогенной ци ветра-холода."],
	technique: "Укол поверхностный, по направлению к точке бай-хуэй, на глубину до 1 см., цзю до 10 минут.",
	specialInfo: ""
};

var xinHui= {
	name: "Синь-хуэй",
	index: "T22",
	specificLocation: "на 2 цуня кзади от передней границы роста волос.",
	bodyPart: "",
   symptoms: ["обморочные состояния вследствии резкого изменения высоты", "резкое изменение цвета лица (в той же ситуации)"],
	technique: "Укол поверхностный, по направлению к точке бай-хуэй, на глубину до 1 см., цзю до 10 минут (кроме тех, у кого ещё не закрылся родничок).",
	specialInfo: ""
};

var shangXing= {
	name: "Шан-син",
	index: "T23",
	specificLocation: "на 1 цунь выше границы роста волос.",
	bodyPart: "",
   symptoms: ["ринит", "носовое кровотечение", "гнойные выделения из носа", "заложенность носа", "расстройства шень"],
	technique: "Укол поверхностный к точке бай-хуэй, на глубину 1 см., цзю до 10 минут (не маленьким детям).",
	specialInfo: ""
};

var shenTing= {
	name: "Шень-тин",
	index: "T24",
	specificLocation: "на ½ цуня выше границы роста волос.",
	bodyPart: "",
   symptoms: ["расстройства шень", "желание ходить без одежды", "желание взобраться повыше и петь"],
	technique: "Укол поверхностный, по направлению к точке бай-хуэй, на глубину до 1 см., цзю до 10 минут.",
	specialInfo: ""
};

var suLiao= {
	name: "Су-ляо",
	index: "T25",
	specificLocation: "на кончике носа.",
	bodyPart: "",
   symptoms: [],
	technique: "Укол наклонный, по направлению к точке между глазами, на глубину 0 мм (!).",
	specialInfo: "В древних источниках указывают не колоть и не прижигать, в современных предлагают использовать в критических состояниях."
};

var shuiGou= {
	name: "Жень-чжун, шуй-гоу",
	index: "T26",
	specificLocation: "в центре верхней трети носогубной складки.",
	bodyPart: "",
   symptoms: ["скорая помощь", "застой ци", "отхождение ци", "нарушения шень", "немотивированное веселье, или грусть"],
	technique: "Укол перпендикулярный (с лёгким наклоном кверху) на глубину до 1 см. (возможно просто сильное надавливание ногтем). Не прижигают.",
	specialInfo: ""
};

var duiDuan= {
	name: "Дуй-дуань",
	index: "T27",
	specificLocation: "на вершине верхней губы, на краю носогубной складки.",
	bodyPart: "",
   symptoms: ["тик верхней губы"],
	technique: "Укол наклонный кверху, на глубину ½ см, не прижигают. ",
	specialInfo: ""
};

var yinJiao= {
	name: "Инь-цзяо",
	index: "T28",
	specificLocation: "на пересечении верхней губы и десны. Внутри рта, в месте уздечки.",
	bodyPart: "",
   symptoms: ["птоз угла рта", "асимметрия лица"],
	technique: "Укол наклонный вверх, на глубину 3 мм., не прижигают.",
	specialInfo: ""
};


var duMai= {
	name: "сосуд ду-май ",
	index: "T",
	channelType: "май",
	layout: "Главный ствол ду-май начинается в области матки (в нижней части живота), идёт по позвоночнику, до точки хань-фу (T16). Там входит в голову и головной мозг, затем опять выходит на поверхность, идёт к макушке, к точке бай-хуэй и затем идёт по срединной линии до лба, огибает нос и заканчивается на верхней губе. Первая ветка сосуда начинается также в матке, идёт вместе с сосудами чун-май и жень-май через промежность и копчик и соединившись с каналом мочевого пузыря оканчивается в почках. Вторая ветка идёт внутренним ходом через пупок и сердце и затем до горла, где соединяется с сосудами жень-май и чун-май. Третья ветка идёт от глаз к точке бай-хуэй, там опять уходит в мозг и затем опускается по позвоночнику к почкам. Наружный ход - от копчика до верхней губы по задне-срединной линии. Ду-май объединяет и активизирует все сосуды ян. В точке да-чжуй (T14) все янские каналы соединяются.",
	basicbodyPart: "",
   symptoms: ["боль в спине", "напряжённые мышцы спины", "задержка мочи", "геморрой", "женское бесплодие", "пересыхание …"],
	luo: [changQiang],
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [changQiang, yaoShu, yaoYangGuan, mingMen, xuanShu, jiZhong, zhongShu, jinSuo, zhiYang, lingTai, shenDao, shenZhu, taoDao, daZhu, yaMen, fengFu, naoHu, qiangJian, houDing, baiHui, qianDing, xinHui, shangXing, shenTing, suLiao, shuiGou, duiDuan, yinJiao]
}


/*Xue of the Conception vessel - Ren Mai*/

var huiYin= {
	name: "Хуэй-инь",
	index: "J1",
	specificLocation: "в центре промежности.",
	bodyPart: "",
   symptoms: ["любые болезни половых органов", "любые заболевания связанные с потерей инь, симптомы которых относятся к мочеполовой сфере", "коматозные состояния",  "маниакальные состояниях, связанных с сексуальной сферой"],
	technique: "Укол перпендикулярный на глубину до 2 см., цзю до ½ часа. ",
	specialInfo: ""
};

var quGu= {
	name: "Цюй-гу",
	index: "J2",
	specificLocation: "по середине верхнего края лобкового симфиза.",
	bodyPart: "",
   symptoms: ["заболевания мочеполовой сферы",  "цистит", "задержка мочеиспускания"],
	technique: "Укол перпендикулярный на глубину до 1½ -3 см., при задержке мочеиспускания надо колоть менее глубоко, так как поверхность мочевого пузыря подходит близко к поверхности кожи. Следует пройти иглой жировой слой и затем углубиться ещё на 1 см. Перед тем, как колоть нужно попросить пациента сходить в туалет. Цзю до 20 минут.",
	specialInfo: ""
};

var zhongJi= {
	name: "Чжун-цзи",
	index: "J3",
	specificLocation: "на 1 цунь выше точки цюй-гу",
	bodyPart: "",
   symptoms: ["любые заболевания мочевого пузыря", "критические состояния (при солнечном ударе)", "задержка плаценты после родов",  "бесплодие", "нарушение половой функции", "мастит", "маточные кровотечения", "дисменорея"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю до 20 минут. Перед уколом нужно попросить пациента сходить в туалет. При беременности укол делается менее глубоким.",
	specialInfo: ""
};

var guanYuan= {
	name: "Гуань-юань",
	index: "J4",
	specificLocation: "на 3 цуня ниже пупка.",
	bodyPart: "",
   symptoms: ["восполнение ян-ци почек", "недостаток первичной ци", "любые заболевания мочеполовой системы", "недостаток или застой крови", "для восполнения ян-ци", "для укрепления первичной ци"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю до 20 минут. Перед уколом нужно попросить пациента сходить в туалет. При беременности не укалывают, чтобы не повредить мешок.",
	specialInfo: ""
};

var shiMen= {
	name: "Ши-мэнь",
	index: "J5",
	specificLocation: "на 2 цуня ниже пупка.",
	bodyPart: "",
   symptoms: ["для прогревания почек", "для активизации ян почек"],
	technique: "Укол перпендикулярный на глубину до 4 см., цзю до 20 минут. Перед уколом нужно попросить пациента сходить в туалет. При беременности не укалывают. В зависимости от комплекции возможно требуется более мелкое укалывание, следует следить за прохождением иглы и после преодоления жирового слоя углубиться ещё на 1 см.",
	specialInfo: ""
};

var qiHai= {
	name: "Ци-хай",
	index: "J6",
	specificLocation: "на 1½ цуня ниже пупка.",
	bodyPart: "",
   symptoms: ["любые расстройства, связанные с ослаблением или застоем ян-ци", "для восполнения крови",  "застой крови", "критические состояния, при отходе ци"],
	technique: "Укол перпендикулярный на глубину до 4 см., цзю до 20 минут. Перед уколом нужно попросить пациента сходить в туалет. При беременности колют, но не глубоко.",
	specialInfo: ""
};

var yinJiao= {
	name: "Инь-цзяо",
	index: "J7",
	specificLocation: "на 1 цунь ниже пупка",
	bodyPart: "",
   symptoms: ["различные гинекологические заболевания", "нарушения менструального цикла", "вагинальные кровотечения"],
	technique: "Укол перпендикулярный на глубину до 4 см., цзю до 30 минут. При беременности не колют (имеет абортивное действие).",
	specialInfo: ""
};

var shenQue= {
	name: "Шень-цюэ",
	index: "J8",
	specificLocation: "прямо в пупке",
	bodyPart: "",
   symptoms: ["резкая потеря ян ци", "обморочные состояния", "нарушения пищеварения", "кровотечение из носа"],
	technique: "Не укалывают, но прижигают. Цзю до 10 минут. В критических состояниях делают очень интенсивный нагрев.",
	specialInfo: ""
};

var shuiFen= {
	name: "Шуй-фэнь",
	index: "J9",
	specificLocation: "на 1 цунь выше пупка.",
	bodyPart: "",
   symptoms: ["нарушение пищеварения","нарушение водного обмена", "отёк", "задержка мочеиспускания", "боль в нижней части живота"],
	technique: "Укол перпендикулярный на глубину до 4 см., цзю до 20 минут.",
	specialInfo: ""
};

var xiaWan= {
	name: "Ся-вань",
	index: "J10",
	specificLocation: "на 2 цуня выше пупка.",
	bodyPart: "",
   symptoms: ["синдром пустоты", "синдром холода в селезёнке", "синдром холода в желудке (несварение)"],
	technique: "Укол перпендикулярный на глубину до 4 см., цзю до 30 минут.",
	specialInfo: ""
};

var jianLi= {
	name: "Цзянь-ли",
	index: "J11",
	specificLocation: "на 3 цуня выше пупка.",
	bodyPart: "",
   symptoms: ["для укрепления ци селезёнки и желудка", "нарушение транспортной функции", "нарушение трансформационной функции", "понос", "недержание", "отрыжка", "запор от скопления пищи"],
	technique: "Укол перпендикулярный на глубину до 4 см., цзю до 15 минут (не прижигают при беременности).",
	specialInfo: ""
};

var zhongWan= {
	name: "Чжун-вань",
	index: "J12",
	specificLocation: "на 4 цуня выше пупка, на середине расстояния между пупком и мечевидным отростком.",
	bodyPart: "",
   symptoms: ["любые проблемы  органов ян",  "недостаток ци селезёнки", "недостаток инь желудка", "холод в желудке", "возгорание огня в желудке", "гинекологические заболевания", "камни в жёлчном"],
	technique: "Укол перпендикулярный на глубину до 4 см., цзю до 30 минут.",
	specialInfo: ""
};

var shangWan= {
	name: "Шан-вань",
	index: "J13",
	specificLocation: "на 5 цуней выше пупка, или на 3 цуня ниже мечевидного отростка.",
	bodyPart: "",
   symptoms: ["извращённый ход ци печени", "пустота или холод в желудке"],
	technique: "Укол перпендикулярный на глубину до 3 см., цзю до 30 минут.",
	specialInfo: ""
};

var juQue= {
	name: "Цзюй-цюэ",
	index: "J14",
	specificLocation: "на 6 цуней выше пупка.",
	bodyPart: "",
   symptoms: ["нарушения пищеварения", "синдромы холода, или пустоты в желудке", "расстройства шень, когда человек начинает ругаться, хотя это ему не свойственно"],
	technique: "Укол наклонный книзу, на глубину до 3 см., цзю до 10 минут.",
	specialInfo: ""
};

var jiuWei= {
	name: "Цзю-вэй",
	index: "J15",
	specificLocation: "под мечевидным отростком (иногда (в зависимости от позиции мечевидного отростка) на 1 цунь ниже, если визуально область между пупком и мечевидным отростком большая - точку колют на 1 цунь ниже).",
	bodyPart: "",
   symptoms: ["эпилепсия"],
	technique: "Колют в положении лёжа на спине с руками за головой (чтобы поднять нижние рёбра). Укол наклонный сверху вниз, на глубину до 1 см., цзю до 30 минут.",
	specialInfo: ""
};

var zhongTing= {
	name: "Чжун-тин",
	index: "J16",
	specificLocation: "на уровне пятого межрёберного промежутка, на срединной линии",
	bodyPart: "",
   symptoms: ["ощущение инородного тела в горле", "срыгивание молока грудным ребёнком"],
	technique: "Укол почти горизонтальный, сверху вниз, на глубину до 1 см., цзю до 15 минут.",
	specialInfo: ""
};

var shanZhong= {
	name: "Тань-чжун",
	index: "J17",
	specificLocation: "на уровне 4 межрёберного промежутка, на передне-срединной линии.",
	bodyPart: "",
   symptoms: ["все нарушения связанные с ци", "патологические нарушения ци лёгких", "все заболевания сердца", "недостаточная лактация"],
	technique: "Укол горизонтальный сверху вниз на глубину до 1 см., цзю до 10 минут.",
	specialInfo: ""
};

var yuTang= {
	name: "Юй-тан",
	index: "J18",
	specificLocation: "на срединной линии, на уровне третьего межрёберного промежутка.",
	bodyPart: "",
   symptoms: ["при кашле (редко)"],
	technique: "Укол горизонтальный сверху вниз на глубину до 1 см., цзю до 10 минут.",
	specialInfo: ""
};

var ziGong= {
	name: "Цзы-гун",
	index: "J19",
	specificLocation: "на срединной линии, на уровне второго межрёберного промежутка.",
	bodyPart: "",
   symptoms: ["кашель с кровью"],
	technique: "Укол горизонтальный сверху вниз на глубину до 1 см., цзю до 10 минут.",
	specialInfo: ""
};

var huaGai= {
	name: "Хуа-гай",
	index: "J20",
	specificLocation: "на срединной линии, на уровне первого межрёберного промежутка.",
	bodyPart: "",
   symptoms: ["сухой кашель", "заболевания горла"],
	technique: "Укол горизонтальный сверху вниз на глубину до 1 см., цзю до 10 минут.",
	specialInfo: ""
};

var xuanJi= {
	name: "Сюань-цзи",
	index: "J21",
	specificLocation: "на 1 цунь выше точки хуа-гай.",
	bodyPart: "",
   symptoms: ["заболевания лёгких (редко)"],
	technique: "Укол горизонтальный сверху вниз на глубину до 1 см., цзю до 20 минут.",
	specialInfo: ""
};

var tianTu= {
	name: "Тянь-ту",
	index: "J22",
	specificLocation: "на нижнем краю яремной впадины.",
	bodyPart: "",
   symptoms: ["для нормализации ци (чаще всего при одышке)", "потеря голоса", "пульс в этой точке указывает на беременность"],
	technique: "Укол наклонный сверху вниз (за внутренним краем грудинной кости), на глубину 2-3 см., цзю до 10 минут.",
	specialInfo: ""
};

var lianQuan= {
	name: "Лянь-цюань",
	index: "J23",
	specificLocation: "под нижним краем щитовидного хряща.",
	bodyPart: "",
   symptoms: ["потеря голоса", "отёк языка"],
	technique: "Укол наклонный вверх, на глубину до 1½ см., цзю до 10 минут.",
	specialInfo: ""
};

var chengJiang= {
	name: "Чэн-цзян",
	index: "J24",
	specificLocation: "в середине подбородочно-губной борозды.",
	bodyPart: "",
   symptoms: ["расстройства шень"],
	technique: "Укол наклонный вверх, на глубину до 1 см., цзю до 10 минут.",
	specialInfo: ""
};


var renMai= {
	name: "сосуд жень-май ",
	index: "J",
	channelType: "-",
	layout: ".",
	basicbodyPart: "",
   symptoms: [],
	luo: jiuWei,
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [huiYin, quGu, zhongJi, guanYuan, shiMen, qiHai, yinJiao, shenQue, shuiFen, xiaWan, jianLi, zhongWan, shangWan, juQue, jiuWei, zhongTing, shanZhong, yuTang, ziGong, huaGai, xuanJi, tianTu, lianQuan, chengJiang]
}

/*List of extraordinary (additional) xue*/

var taiYang= {
	name: "Тай-ян",
	index: "PC9",
	specificLocation: "на 1 цунь кзади от точки на середине линии между краем брови и внешним углом глаза (точками тун-цзы-ляо и сы-чжу-кун).",
	bodyPart: "",
   symptoms: ["простуды, сопровождающиеся головной болью", "лихорадка с головной болью с потом, или без пота", "невралгия тройничного нерва", "неврит лицевого нерва", "гемикрания", "любые нарушения связанные с глазами"],
	technique: "Укол горизонтальный, сверху вниз, на глубину до 2 см., или перпендикулярный, а глубину до 3 мм. Точку не прижигают.",
	specialInfo: ""
};

var yinTang= {
	name: "Инь-тан",
	index: "PC3",
	specificLocation: "посередине между медиальными краями бровей.",
	bodyPart: "",
   symptoms: ["головная боль в лобной части", "неврита лицевого нерва, приводящий к асимметрии", "носовое кровотечение"],
	technique: "Укол горизонтальный книзу и в сторону (при асимметрии - в сторону пареза), при головной боли - перпендикулярный укол на глубину до 3 мм., с получением капли крови.",
	specialInfo: ""
};

var jinJinYuYe= {
	name: "Цзинь-цзинь и юй-е",
	index: "PC20",
	specificLocation: "слева и справа от уздечки языка. В этом месте проходят подъязычные вены.",
	bodyPart: "",
   symptoms: ["болезнь Паркинсона", "скованность языка", "затруднение при произношении слов","расстройство шень"],
	technique: "Укол перпендикулярный, на глубину 2 см. Не прижигают. Можно колоть точечно до (и для) получения капли крови (если речь идёт о работе с ригидностью языка).",
	specialInfo: ""
};

var anMian= {
	name: "Ань-мянь",
	index: "PN27",
	specificLocation: "посередине между точками и-фэн и и-мин (и-мин располагается на 1 цунь кзади от и-фэн).",
	bodyPart: "",
   symptoms: ["нарушения сна"],
	technique: "Укол перпендикулярный, на глубину до 3 см. Цзю до 10 минут.",
	specialInfo: ""
};

var baiLao= {
	name: "Бай-лао",
	index: "PC30",
	specificLocation: "на 2 цуня вверх и на 1 цунь латеральнее точки да-чжуй.",
	bodyPart: "",
   symptoms: ["переутомление"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Цзю до 15 минут.",
	specialInfo: ""
};

var danNangXue= {
	name: "Дань-нан-сюэ",
	index: "PC152",
	specificLocation: "на 1 цунь ниже точки ян-лин-цюань",
	bodyPart: "",
   symptoms: ["камни в жёлчном пузыре", "воспаление в жёлчных протоках"],
	technique: "Укол перпендикулярный, на глубину до 4 см. Не прижигают.",
	specialInfo: ""
};

var dingChuan= {
	name: "Дин-чуань",
	index: "PN45",
	specificLocation: "на ½ цуня латеральнее точки да-чжуй.",
	bodyPart: "",
   symptoms: ["одышка"],
	technique: "",
	specialInfo: "Укол перпендикулярно, на глубину до 1½ см. Цзю до 5 минут."
};

var piGen= {
	name: "Пи-гэнь",
	index: "PC66",
	specificLocation: "на 3½ цуня латеральнее остистого отростка 1 поясничного позвонка (L1).",
	bodyPart: "",
   symptoms: ["затвердение в брюшной полости (поверхностное)"],
	technique: "Укол перпендикулярный, на глубину до 2 см. Цзю до 10 минут.",
	specialInfo: ""
};

var xiYan= {
	name: "Си-янь",
	index: "PC145",
	specificLocation: "следующим образом. Это двойная точка, одна из которых соответствует точке ду-би, а вторая находится в соответствующей медиальной впадине.",
	bodyPart: "",
   symptoms: ["боль в колене"],
	technique: "Укол перпендикулярный, на глубину до 1 см. Цзю до 10 минут.",
	specialInfo: ""
};

var ziGongXue= {
	name: "Цзы-гун",
	index: "PC49",
	specificLocation: "на 3 цуня кнаружи от точки чжун-цзи.",
	bodyPart: "",
   symptoms: ["бесплодие"],
	technique: "Укол наклонный по направлению к лобковому симфизу, на глубину до 4 см. Цзю до 15 минут.",
	specialInfo: ""
};

var yuYao= {
	name: "Юй-яо",
	index: "PC6",
	specificLocation: "на середине брови, на уровне зрачка смотрящего прямо.",
	bodyPart: "",
   symptoms: ["невралгия тройничного нерва"],
	technique: "Укол перпендикулярный на глубину до 2 мм. Не прижигают.",
	specialInfo: ""
};

var shiXuan= {
	name: "Ши-сюань",
	index: "PC86",
	specificLocation: "на кончиках пальцев рук",
	bodyPart: "",
   symptoms: ["скорая помощь"],
	technique: "Используются при скорой помощи. Укол как у истоков, до получения капли крови.",
	specialInfo: ""
};


var qiXue= {
	name: "основные внеканальные точки",
	index: "PC",
	channelType: "",
	layout: "",
	basicbodyPart: "",
   symptoms: [""],
	luo: "",
	luoSyndrom: ["kuku", "mumu", "lulu"],
	xueList: [taiYang, yinTang, jinJinYuYe, anMian, baiLao, danNangXue, dingChuan, piGen, xiYan, ziGong, yuYao, shiXuan]
}












/*General variable definitions*/

var fullXueSystem = [shouTaiYinFeiJing, shouYangMingDaChangJing, zuYangMingWeiJing, zuTaiYinPiJing, shouShaoYinXinJing, shouTaiYangXiaChangJing, zuTaiYangPangGaungJing, zuShaoYinShenJing, shouJueYinXinBaoLuoJing, shouShaoYangSanJiaoJing, zuShaoYangDanJing, zuJueYinGanJing, duMai, renMai, qiXue]; // array that contains all the jing elements

var fullXueArray = fullXueSystem.reduce((a, b) => a.concat(b.xueList), []); // array of all the xue objects in the whole fullXueSystem 

var fullIndexArray = fullXueArray.map(a => a.index) // array of all the xue indices in the whole fullXueSystem 

var fullNameArray = fullXueArray.map(a => a.name) // similarly, it is an array of all the xue names in the whole fullXueSystem 

var fullSymptomsArray = fullXueArray.reduce((a, b) => a.concat(b.symptoms), []);  // similarly, it is an array of all the xue symptoms in the whole fullXueSystem 

fullSymptomsArray = SortAndRemoveDuplicates(fullSymptomsArray);

//Names of the xue pictures 
var pPicsNames = ["P.1.2.", "P.3.4.5.", "P.5.6.9.", "P.7.", "P.8.9.", "P.10.11."];
var giPicsNames = ["GI.1.2.3.4.","GI.5.", "GI.6.7.8.9.10.11.", "GI.12.13.14.", "GI.15.", "GI.16.", "GI.17.18.", "GI.19.20."];
var ePicsNames = ["E.1.2.3.4.", "E.5.6.7.8.", "E.9.10.11.", "E.12.", "E.13.14.15.16.17.18.", "E.19.20.21.22.23.24.25.26.27.28.29.30.", "E.31.32.33.34.", "E.35.36.37.38.40.", "E.41.42.53.44.45."];
var rpPicsNames = ["RP.1.2.3.4.5.", "RP.6.7.8.9.", "RP.10.", "RP.11.12.", "RP.13.14.15.16.", "RP.17.18.19.20.", "RP.21."];
var cPicsNames = ["C.1.2.3.", "C.4.5.6.7.", "C.8.9."];
var igPicsNames = ["IG.1.", "IG.2.3.", "IG.4.5.", "IG.6.7.8.", "IG.9.10.", "IG.11.12.13.", "IG.14.15.", "IG.16.17.18.", "IG.19."];
var vPicsNames = ["V.1.2.3.4.", "V.5.6.7.8.", "V.9.10.", "V.11.12.13.14.15.16.17.18.19.20.21.22.23.", "V.23.24.25.26.27.28.29.30.31.32.33.34.35.", "V.36.37.38.39.40.", "V.41.42.43.44.45.46.47.48.49.50.51.52.53.54.", "V.55.56.57.58.59.60.", "V.61.62.63.64.65.66.67."];
var rPicsNames = ["R.1.", "R.2.", "R.3.4.", "R.5.6.", "R.7.8.", "R.9.", "R.10.", "R.11.12.13.14.15.16.", "R.17.18.19.20.21.", "R.22.23.24.25.26.27."];
var mcPicsNames = ["MC.1.", "MC.2.3.", "MC.4.5.6.7.", "MC.8.9."];
var trPicsNames = ["TR.1.2.3.4.", "TR.5.6.7.8.9.", "TR.10.", "TR.11.12.13.14.", "TR.15.", "TR.16.", "TR.17.18.19.20.", "TR.21.22.23."];
var vbPicsNames = ["VB.1.2.3", "VB.4.5.6.7.", "VB.8.9.10.11.12.", "VB.13.14.15.", "VB.16.17.18.19.20.", "VB.21.", "VB.22.23.", "VB.24.", "VB.25.26.", "VB.27.28.29.", "VB.30.", "VB.31.32.33.34.", "VB.35.36.37.38.39.", "VB.40.41.42.43.44."];
var fPicsNames = ["F.1.2.3.4.", "F.5.6.7.", "F.8.9.", "F.10.11.12.", "F.13.", "F.14."];
var tPicsNames = ["T.1.2.3.4.5.6.7.8.9.10.11.12.13.14.", "T.15.16.17.18.19.", "T.20.21.22.23.24.", "T.25.26.27.", "T.28."];
var jPicsNames = ["J.1.", "J.2.3.4.5.6.7.8.", "J.9.10.11.12.13.14.15.", "J.16.17.18.19.20.21.", "J.22.23.24."];
var fullPicsNames = [pPicsNames, giPicsNames, ePicsNames, rpPicsNames, cPicsNames, igPicsNames, vPicsNames, rPicsNames, mcPicsNames, trPicsNames, vbPicsNames, fPicsNames, tPicsNames, jPicsNames];
	

function SortAndRemoveDuplicates(array) {
	array.sort();
	for (i=0; i<array.length-1; i++){
		if(array[i] === array[i+1]) {
			array.splice(i,1);
			i=i-1
		}
	}
	return array
}